{
  "level": "Advanced",
  "topics": [
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Subjuntivo Avanzado",
      "description": "Profundiza en los usos avanzados del subjuntivo en español. Aprende usos complejos del subjuntivo en diferentes tiempos (presente, imperfecto, pluscuamperfecto) y en situaciones avanzadas. Dominar el subjuntivo avanzado te permite expresar matices sutiles y situaciones complejas. Piensa en el subjuntivo avanzado como el modo de la sofisticación en español.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Subjuntivo Avanzado: Una Guía Completa",
          "content": "Paso 1: Repasa subjuntivo presente. Paso 2: Aprende subjuntivo imperfecto. Paso 3: Aprende subjuntivo pluscuamperfecto. Paso 4: Aprende usos avanzados del subjuntivo. Paso 5: Aprende cláusulas adverbiales complejas. Paso 6: Practica con subjuntivo avanzado. Paso 7: Practica subjuntivo avanzado. Esta guía te ayuda a dominar subjuntivo avanzado."
        },
        {
          "type": "Guía Visual",
          "title": "Subjuntivo Avanzado",
          "content": "Dibuja subjuntivo: Presente → Imperfecto → Pluscuamperfecto → Usos avanzados. Muestra: Tiempos, Cláusulas, Matices. La guía visual ayuda a entender subjuntivo avanzado."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Subjuntivo Avanzado",
          "content": "Actividad: Practica subjuntivo avanzado en español. Practica: Tiempos, Cláusulas, Usos avanzados, Oraciones complejas. Practica: Fluidez, Sofisticación. Esta actividad mejora tu conocimiento de subjuntivo avanzado."
        }
      ],
      "key_points": [
        {
          "title": "Subjuntivo Imperfecto 📝",
          "content": "El subjuntivo imperfecto se usa en situaciones pasadas o hipotéticas. **Conjugación -ar:** -ara/-ase, -aras/-ases, -ara/-ase, -áramos/-ásemos, -arais/-aseis, -aran/-asen. **Conjugación -er/-ir:** -iera/-iese, -ieras/-ieses, -iera/-iese, -iéramos/-iésemos, -ierais/-ieseis, -ieran/-iesen. **Cómo entenderlo:** Como subjuntivo en el pasado. **Mundo real:** Estudiante usa subjuntivo imperfecto: Dice 'Si tuviera tiempo, viajaría', Expresa hipótesis pasada, Subjuntivo imperfecto usado. El subjuntivo imperfecto es importante. **Mejor práctica:** Aprende conjugación, Usa para hipótesis, Practica subjuntivo imperfecto, Practica subjuntivo imperfecto."
        },
        {
          "title": "Subjuntivo Pluscuamperfecto 📄",
          "content": "El subjuntivo pluscuamperfecto expresa acciones pasadas en relación con otras acciones. **Formación:** Hubiera/Hubiese + participio pasado. **Ejemplos:** Hubiera venido, Hubiese estudiado. **Cómo entenderlo:** Como subjuntivo en pasado perfecto. **Mundo real:** Estudiante usa subjuntivo pluscuamperfecto: Dice 'Si hubiera sabido, habría venido', Expresa arrepentimiento pasado, Subjuntivo pluscuamperfecto usado. El subjuntivo pluscuamperfecto es avanzado. **Mejor práctica:** Aprende formación, Usa para arrepentimiento, Practica subjuntivo pluscuamperfecto, Practica subjuntivo pluscuamperfecto."
        },
        {
          "title": "Cláusulas Adverbiales Avanzadas 🔗",
          "content": "Las cláusulas adverbiales complejas requieren subjuntivo. **Cláusulas:** A menos que (unless), Con tal de que (provided that), En caso de que (in case), Para que (so that), Sin que (without). **Cómo entenderlo:** Como cláusulas que siempre requieren subjuntivo. **Mundo real:** Estudiante usa cláusulas: Dice 'A menos que vengas, no iré', Usa subjuntivo, Cláusulas usadas correctamente. Las cláusulas son importantes. **Mejor práctica:** Aprende cláusulas, Memoriza usos, Practica cláusulas, Practica cláusulas adverbiales avanzadas."
        },
        {
          "title": "Subjuntivo en Oraciones Relativas ⚠️",
          "content": "El subjuntivo se usa en oraciones relativas con negación o incertidumbre. **Uso:** Busco un libro que sea interesante (subjuntivo), No hay nadie que sepa la respuesta (subjuntivo). **Cómo entenderlo:** Como subjuntivo en oraciones que describen. **Mundo real:** Estudiante usa subjuntivo: Dice 'Busco alguien que hable español', Usa subjuntivo en relativa, Subjuntivo usado correctamente. El subjuntivo en relativas es avanzado. **Mejor práctica:** Aprende usos, Identifica negación, Practica relativas, Practica subjuntivo en oraciones relativas."
        },
        {
          "title": "Matices del Subjuntivo 🎯",
          "content": "El subjuntivo expresa matices sutiles. **Matices:** Duda, Deseo, Emoción, Recomendación, Necesidad. **Cómo entenderlo:** Como expresar diferentes matices. **Mundo real:** Estudiante expresa matices: Usa subjuntivo para duda, Usa subjuntivo para deseo, Matices expresados, Matices dominados. Los matices son importantes. **Mejor práctica:** Aprende matices, Practica expresión, Usa correctamente, Practica matices del subjuntivo."
        }
      ],
      "examples": [
        {
          "scenario": "Subjuntivo Imperfecto",
          "explanation": "Estudiante usa subjuntivo imperfecto: Dice 'Si tuviera tiempo, viajaría', Expresa hipótesis, Subjuntivo imperfecto usado correctamente."
        },
        {
          "scenario": "Subjuntivo Pluscuamperfecto",
          "explanation": "Estudiante usa subjuntivo pluscuamperfecto: Dice 'Si hubiera sabido, habría venido', Expresa arrepentimiento, Subjuntivo pluscuamperfecto usado."
        },
        {
          "scenario": "Cláusulas Adverbiales",
          "explanation": "Estudiante usa cláusulas: Dice 'A menos que vengas, no iré', Usa subjuntivo, Cláusulas usadas correctamente."
        },
        {
          "scenario": "Oraciones Relativas",
          "explanation": "Estudiante usa subjuntivo: Dice 'Busco alguien que hable español', Usa subjuntivo en relativa, Subjuntivo usado correctamente."
        }
      ],
      "exercises": [
        {
          "title": "Practica Subjuntivo Imperfecto",
          "instructions": "Paso 1: Aprende conjugación de subjuntivo imperfecto. Paso 2: Practica conjugar verbos regulares. Paso 3: Aprende verbos irregulares. Paso 4: Practica conjugar irregulares. Paso 5: Usa subjuntivo imperfecto en oraciones. Paso 6: Practica con hipótesis. Paso 7: Practica subjuntivo imperfecto.",
          "example_answer": "Subjuntivo imperfecto practicado: Conjugación aprendida, Verbos regulares conjugados, Verbos irregulares aprendidos, Irregulares conjugados, Oraciones con subjuntivo imperfecto, Hipótesis practicadas, Subjuntivo imperfecto dominado."
        },
        {
          "title": "Practica Subjuntivo Pluscuamperfecto",
          "instructions": "Paso 1: Aprende formación de subjuntivo pluscuamperfecto. Paso 2: Practica formar subjuntivo pluscuamperfecto. Paso 3: Usa subjuntivo pluscuamperfecto en oraciones. Paso 4: Practica con arrepentimiento. Paso 5: Practica con situaciones pasadas. Paso 6: Crea oraciones con subjuntivo pluscuamperfecto. Paso 7: Practica subjuntivo pluscuamperfecto.",
          "example_answer": "Subjuntivo pluscuamperfecto practicado: Formación aprendida, Subjuntivo pluscuamperfecto formado, Oraciones con subjuntivo pluscuamperfecto, Arrepentimiento practicado, Situaciones pasadas practicadas, Oraciones creadas, Subjuntivo pluscuamperfecto dominado."
        },
        {
          "title": "Practica Usos Avanzados",
          "instructions": "Paso 1: Repasa cláusulas adverbiales. Paso 2: Aprende subjuntivo en oraciones relativas. Paso 3: Practica con matices. Paso 4: Crea oraciones complejas. Paso 5: Practica con diferentes contextos. Paso 6: Identifica usos avanzados. Paso 7: Practica usos avanzados.",
          "example_answer": "Usos avanzados practicados: Cláusulas repasadas, Subjuntivo en relativas aprendido, Matices practicados, Oraciones complejas creadas, Diferentes contextos practicados, Usos identificados, Usos avanzados dominados."
        }
      ],
      "textbooks": [
        {
          "title": "Subjuntivo Avanzado en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de subjuntivo avanzado en español."
        },
        {
          "title": "Gramática Española: Subjuntivo Complejo",
          "source": "OpenStax",
          "reason": "Cubre subjuntivo avanzado, tiempos complejos y usos sofisticados."
        }
      ],
      "videos": [
        {
          "title": "Subjuntivo Avanzado Tutorial – Traversy Media",
          "reason": "Guía completa de subjuntivo avanzado en español."
        },
        {
          "title": "Subjuntivo Complejo en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre subjuntivo avanzado y usos complejos."
        }
      ],
      "summary": "El subjuntivo avanzado incluye subjuntivo imperfecto (Si tuviera tiempo, viajaría) y subjuntivo pluscuamperfecto (Si hubiera sabido, habría venido). Las cláusulas adverbiales avanzadas como 'A menos que', 'Con tal de que' y 'En caso de que' siempre requieren subjuntivo. El subjuntivo se usa en oraciones relativas con negación o incertidumbre (Busco alguien que hable español). El subjuntivo expresa matices sutiles de duda, deseo, emoción y necesidad. Dominar el subjuntivo avanzado te permite expresar situaciones complejas y matices sutiles en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Tiempos Perfectos",
      "description": "Aprende a usar los tiempos perfectos en español: presente perfecto, pretérito perfecto, futuro perfecto y condicional perfecto. Los tiempos perfectos expresan acciones completadas en relación con otros momentos temporales. Dominar los tiempos perfectos te permite hablar sobre acciones completadas con precisión temporal. Piensa en los tiempos perfectos como acciones terminadas en relación con el presente, pasado o futuro.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Tiempos Perfectos: Una Guía Completa",
          "content": "Paso 1: Aprende presente perfecto (he, has, ha, hemos, habéis, han + participio). Paso 2: Aprende pretérito perfecto (hube, hubiste, hubo, hubimos, hubisteis, hubieron + participio). Paso 3: Aprende futuro perfecto (habré, habrás, habrá, habremos, habréis, habrán + participio). Paso 4: Aprende condicional perfecto (habría, habrías, habría, habríamos, habríais, habrían + participio). Paso 5: Aprende usos de cada tiempo. Paso 6: Practica con tiempos perfectos. Paso 7: Practica tiempos perfectos. Esta guía te ayuda a dominar tiempos perfectos."
        },
        {
          "type": "Guía Visual",
          "title": "Tiempos Perfectos",
          "content": "Dibuja tiempos: Presente perfecto → Pretérito perfecto → Futuro perfecto → Condicional perfecto. Muestra: Formación, Usos, Relaciones temporales. La guía visual ayuda a entender tiempos perfectos."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Tiempos Perfectos",
          "content": "Actividad: Practica tiempos perfectos en español. Practica: Formación, Usos, Relaciones temporales, Oraciones complejas. Practica: Fluidez, Precisión. Esta actividad mejora tu conocimiento de tiempos perfectos."
        }
      ],
      "key_points": [
        {
          "title": "Presente Perfecto ⏰",
          "content": "El presente perfecto expresa acciones completadas con relación al presente. **Formación:** Haber (presente) + Participio pasado. **Ejemplos:** He comido, Has estudiado, Ha llegado. **Usos:** Acciones recientes, Experiencias de vida, Acciones que continúan. **Cómo entenderlo:** Como acciones completadas hasta ahora. **Mundo real:** Estudiante usa presente perfecto: Dice 'He viajado a España', Expresa experiencia, Presente perfecto usado correctamente. El presente perfecto es común. **Mejor práctica:** Aprende formación, Usa para experiencias, Practica presente perfecto, Practica presente perfecto."
        },
        {
          "title": "Pretérito Perfecto 📝",
          "content": "El pretérito perfecto expresa acciones completadas antes de otra acción pasada. **Formación:** Haber (pretérito) + Participio pasado. **Ejemplos:** Hube comido, Hubiste estudiado, Hubo llegado. **Usos:** Acciones completadas antes de otra acción pasada, Secuencia de eventos pasados. **Cómo entenderlo:** Como pasado del pasado. **Mundo real:** Estudiante usa pretérito perfecto: Dice 'Cuando llegué, ya había comido', Expresa secuencia, Pretérito perfecto usado. El pretérito perfecto es avanzado. **Mejor práctica:** Aprende formación, Usa para secuencias, Practica pretérito perfecto, Practica pretérito perfecto."
        },
        {
          "title": "Futuro Perfecto 🔮",
          "content": "El futuro perfecto expresa acciones que se completarán antes de un momento futuro. **Formación:** Haber (futuro) + Participio pasado. **Ejemplos:** Habré comido, Habrás estudiado, Habrá llegado. **Usos:** Acciones que se completarán antes de un momento futuro, Probabilidad en pasado. **Cómo entenderlo:** Como futuro del pasado. **Mundo real:** Estudiante usa futuro perfecto: Dice 'Para mañana habré terminado', Expresa completitud futura, Futuro perfecto usado. El futuro perfecto es avanzado. **Mejor práctica:** Aprende formación, Usa para futuro, Practica futuro perfecto, Practica futuro perfecto."
        },
        {
          "title": "Condicional Perfecto 💭",
          "content": "El condicional perfecto expresa acciones que habrían ocurrido. **Formación:** Haber (condicional) + Participio pasado. **Ejemplos:** Habría comido, Habrías estudiado, Habría llegado. **Usos:** Acciones hipotéticas en pasado, Cortesía avanzada, Probabilidad en pasado. **Cómo entenderlo:** Como condicional del pasado. **Mundo real:** Estudiante usa condicional perfecto: Dice 'Habría venido si hubiera sabido', Expresa hipótesis pasada, Condicional perfecto usado. El condicional perfecto es avanzado. **Mejor práctica:** Aprende formación, Usa para hipótesis, Practica condicional perfecto, Practica condicional perfecto."
        },
        {
          "title": "Participios Pasados Irregulares ⚠️",
          "content": "Algunos verbos tienen participios irregulares. **Irregulares comunes:** Abrir (abierto), Escribir (escrito), Hacer (hecho), Decir (dicho), Ver (visto), Volver (vuelto). **Cómo entenderlo:** Como participios que no siguen el patrón -ado/-ido. **Mundo real:** Estudiante usa participios: Usa 'hecho' en vez de 'hacido', Usa participio irregular, Participios usados correctamente. Los participios irregulares son importantes. **Mejor práctica:** Aprende irregulares, Memoriza participios, Practica irregulares, Practica participios pasados irregulares."
        }
      ],
      "examples": [
        {
          "scenario": "Presente Perfecto",
          "explanation": "Estudiante usa presente perfecto: Dice 'He viajado a España', Expresa experiencia, Presente perfecto usado correctamente."
        },
        {
          "scenario": "Pretérito Perfecto",
          "explanation": "Estudiante usa pretérito perfecto: Dice 'Cuando llegué, ya había comido', Expresa secuencia, Pretérito perfecto usado."
        },
        {
          "scenario": "Futuro Perfecto",
          "explanation": "Estudiante usa futuro perfecto: Dice 'Para mañana habré terminado', Expresa completitud futura, Futuro perfecto usado."
        },
        {
          "scenario": "Condicional Perfecto",
          "explanation": "Estudiante usa condicional perfecto: Dice 'Habría venido si hubiera sabido', Expresa hipótesis pasada, Condicional perfecto usado."
        }
      ],
      "exercises": [
        {
          "title": "Practica Presente Perfecto",
          "instructions": "Paso 1: Aprende formación de presente perfecto. Paso 2: Aprende participios regulares. Paso 3: Aprende participios irregulares. Paso 4: Practica formar presente perfecto. Paso 5: Usa presente perfecto en oraciones. Paso 6: Practica con experiencias. Paso 7: Practica presente perfecto.",
          "example_answer": "Presente perfecto practicado: Formación aprendida, Participios regulares aprendidos, Participios irregulares aprendidos, Presente perfecto formado, Oraciones con presente perfecto, Experiencias practicadas, Presente perfecto dominado."
        },
        {
          "title": "Practica Tiempos Perfectos Avanzados",
          "instructions": "Paso 1: Aprende pretérito perfecto. Paso 2: Aprende futuro perfecto. Paso 3: Aprende condicional perfecto. Paso 4: Practica formar cada tiempo. Paso 5: Usa en oraciones. Paso 6: Practica con relaciones temporales. Paso 7: Practica tiempos perfectos avanzados.",
          "example_answer": "Tiempos perfectos avanzados practicados: Pretérito perfecto aprendido, Futuro perfecto aprendido, Condicional perfecto aprendido, Cada tiempo formado, Oraciones creadas, Relaciones temporales practicadas, Tiempos perfectos avanzados dominados."
        },
        {
          "title": "Practica Participios Irregulares",
          "instructions": "Paso 1: Aprende participios irregulares comunes. Paso 2: Memoriza participios irregulares. Paso 3: Practica usar participios irregulares. Paso 4: Usa en tiempos perfectos. Paso 5: Practica con diferentes verbos. Paso 6: Identifica participios irregulares. Paso 7: Practica participios irregulares.",
          "example_answer": "Participios irregulares practicados: Participios irregulares aprendidos, Participios memorizados, Participios irregulares usados, Tiempos perfectos con irregulares, Diferentes verbos practicados, Participios identificados, Participios irregulares dominados."
        }
      ],
      "textbooks": [
        {
          "title": "Tiempos Perfectos en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de tiempos perfectos en español."
        },
        {
          "title": "Gramática Española: Tiempos Compuestos",
          "source": "OpenStax",
          "reason": "Cubre tiempos perfectos, formación y usos avanzados."
        }
      ],
      "videos": [
        {
          "title": "Tiempos Perfectos Tutorial – Traversy Media",
          "reason": "Guía completa de tiempos perfectos en español."
        },
        {
          "title": "Tiempos Compuestos en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre tiempos perfectos y compuestos."
        }
      ],
      "summary": "Los tiempos perfectos expresan acciones completadas en relación con otros momentos temporales. El presente perfecto (He comido) expresa acciones completadas con relación al presente. El pretérito perfecto (Hube comido) expresa acciones completadas antes de otra acción pasada. El futuro perfecto (Habré comido) expresa acciones que se completarán antes de un momento futuro. El condicional perfecto (Habría comido) expresa acciones hipotéticas en pasado. Algunos verbos tienen participios irregulares (abierto, escrito, hecho, dicho, visto, vuelto). Dominar los tiempos perfectos te permite hablar sobre acciones completadas con precisión temporal en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Voz Pasiva y Expresiones Impersonales",
      "description": "Aprende a usar la voz pasiva y expresiones impersonales en español. La voz pasiva enfatiza la acción o el objeto en lugar del sujeto. Las expresiones impersonales permiten hablar sin especificar quién realiza la acción. Dominar voz pasiva e impersonales te permite expresar ideas de manera más formal y sofisticada. Piensa en la voz pasiva como cambiar el enfoque de quién hace algo a qué se hace.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Voz Pasiva: Una Guía Completa",
          "content": "Paso 1: Aprende formación de voz pasiva (ser + participio). Paso 2: Aprende voz pasiva con 'se'. Paso 3: Aprende expresiones impersonales (se + verbo). Paso 4: Aprende diferencias entre pasiva y impersonal. Paso 5: Practica con voz pasiva. Paso 6: Practica con expresiones impersonales. Paso 7: Practica voz pasiva e impersonales. Esta guía te ayuda a dominar voz pasiva e impersonales."
        },
        {
          "type": "Guía Visual",
          "title": "Voz Pasiva e Impersonales",
          "content": "Dibuja voz: Pasiva (ser + participio) → Pasiva con 'se' → Impersonal (se + verbo). Muestra: Formación, Usos, Diferencias. La guía visual ayuda a entender voz pasiva e impersonales."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Voz Pasiva",
          "content": "Actividad: Practica voz pasiva en español. Practica: Formación, Usos, Impersonales, Oraciones formales. Practica: Fluidez, Sofisticación. Esta actividad mejora tu conocimiento de voz pasiva."
        }
      ],
      "key_points": [
        {
          "title": "Voz Pasiva con 'Ser' 📝",
          "content": "La voz pasiva se forma con ser + participio. **Formación:** Ser (conjugado) + Participio pasado + Por (opcional). **Ejemplos:** El libro fue escrito por el autor, La casa fue construida. **Cómo entenderlo:** Como cambiar el enfoque de quién hace a qué se hace. **Mundo real:** Estudiante usa voz pasiva: Dice 'El libro fue escrito', Enfatiza acción, Voz pasiva usada correctamente. La voz pasiva es formal. **Mejor práctica:** Aprende formación, Usa para formalidad, Practica voz pasiva, Practica voz pasiva con ser."
        },
        {
          "title": "Voz Pasiva con 'Se' 🔄",
          "content": "La pasiva con 'se' es más común en español. **Formación:** Se + Verbo (3ra persona) + Sustantivo. **Ejemplos:** Se venden libros, Se construyen casas. **Cómo entenderlo:** Como pasiva sin especificar quién hace. **Mundo real:** Estudiante usa pasiva con se: Dice 'Se venden libros', Usa pasiva con se, Pasiva con se usada. La pasiva con se es común. **Mejor práctica:** Aprende formación, Usa para generalidad, Practica pasiva con se, Practica voz pasiva con se."
        },
        {
          "title": "Expresiones Impersonales 💡",
          "content": "Las expresiones impersonales no tienen sujeto específico. **Formación:** Se + Verbo (3ra persona singular). **Ejemplos:** Se dice que..., Se cree que..., Se sabe que... **Cómo entenderlo:** Como expresiones sin sujeto. **Mundo real:** Estudiante usa impersonal: Dice 'Se dice que lloverá', Expresa generalidad, Impersonal usado correctamente. Las impersonales son útiles. **Mejor práctica:** Aprende formación, Usa para generalidad, Practica impersonales, Practica expresiones impersonales."
        },
        {
          "title": "Diferencias: Pasiva vs Impersonal 🎯",
          "content": "La pasiva tiene objeto, la impersonal no. **Pasiva:** Se venden libros (libros = objeto), Se construyen casas (casas = objeto). **Impersonal:** Se dice que... (no hay objeto), Se cree que... (no hay objeto). **Cómo entenderlo:** Como pasiva con objeto vs impersonal sin objeto. **Mundo real:** Estudiante diferencia: Usa pasiva con objeto, Usa impersonal sin objeto, Diferencia entendida. Las diferencias son importantes. **Mejor práctica:** Aprende diferencias, Identifica objeto, Practica diferencias, Practica diferencias entre pasiva e impersonal."
        },
        {
          "title": "Uso Formal de Voz Pasiva 📄",
          "content": "La voz pasiva se usa en contextos formales. **Contextos:** Escritura académica, Noticias, Documentos oficiales. **Cómo entenderlo:** Como lenguaje formal y objetivo. **Mundo real:** Estudiante usa pasiva: Usa en escritura formal, Expresa objetividad, Pasiva usada apropiadamente. El uso formal es importante. **Mejor práctica:** Aprende contextos, Usa apropiadamente, Practica uso formal, Practica uso formal de voz pasiva."
        }
      ],
      "examples": [
        {
          "scenario": "Voz Pasiva con Ser",
          "explanation": "Estudiante usa voz pasiva: Dice 'El libro fue escrito por el autor', Enfatiza acción, Voz pasiva usada correctamente."
        },
        {
          "scenario": "Pasiva con Se",
          "explanation": "Estudiante usa pasiva: Dice 'Se venden libros', Usa pasiva con se, Pasiva con se usada."
        },
        {
          "scenario": "Expresión Impersonal",
          "explanation": "Estudiante usa impersonal: Dice 'Se dice que lloverá', Expresa generalidad, Impersonal usado correctamente."
        },
        {
          "scenario": "Uso Formal",
          "explanation": "Estudiante usa pasiva: Usa en escritura formal, Expresa objetividad, Pasiva usada apropiadamente."
        }
      ],
      "exercises": [
        {
          "title": "Practica Voz Pasiva con Ser",
          "instructions": "Paso 1: Aprende formación de voz pasiva. Paso 2: Practica formar voz pasiva. Paso 3: Usa voz pasiva en oraciones. Paso 4: Practica con 'por' (agente). Paso 5: Practica sin 'por'. Paso 6: Crea oraciones con voz pasiva. Paso 7: Practica voz pasiva con ser.",
          "example_answer": "Voz pasiva con ser practicada: Formación aprendida, Voz pasiva formada, Oraciones con voz pasiva, 'Por' practicado, Sin 'por' practicado, Oraciones creadas, Voz pasiva con ser dominada."
        },
        {
          "title": "Practica Pasiva con Se e Impersonales",
          "instructions": "Paso 1: Aprende pasiva con se. Paso 2: Aprende expresiones impersonales. Paso 3: Practica formar pasiva con se. Paso 4: Practica formar impersonales. Paso 5: Usa en oraciones. Paso 6: Practica diferencias. Paso 7: Practica pasiva con se e impersonales.",
          "example_answer": "Pasiva con se e impersonales practicadas: Pasiva con se aprendida, Impersonales aprendidas, Pasiva con se formada, Impersonales formadas, Oraciones creadas, Diferencias practicadas, Pasiva con se e impersonales dominadas."
        },
        {
          "title": "Practica Uso Formal",
          "instructions": "Paso 1: Aprende contextos formales. Paso 2: Practica usar voz pasiva en escritura. Paso 3: Practica en contextos académicos. Paso 4: Practica expresar objetividad. Paso 5: Crea textos formales. Paso 6: Practica con diferentes contextos. Paso 7: Practica uso formal.",
          "example_answer": "Uso formal practicado: Contextos aprendidos, Escritura practicada, Contextos académicos practicados, Objetividad expresada, Textos formales creados, Diferentes contextos practicados, Uso formal dominado."
        }
      ],
      "textbooks": [
        {
          "title": "Voz Pasiva en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de voz pasiva y expresiones impersonales."
        },
        {
          "title": "Gramática Española: Voz Pasiva",
          "source": "OpenStax",
          "reason": "Cubre voz pasiva, impersonales y usos formales."
        }
      ],
      "videos": [
        {
          "title": "Voz Pasiva Tutorial – Traversy Media",
          "reason": "Guía completa de voz pasiva en español."
        },
        {
          "title": "Voz Pasiva e Impersonales en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre voz pasiva y expresiones impersonales."
        }
      ],
      "summary": "La voz pasiva se forma con ser + participio (El libro fue escrito) y enfatiza la acción en lugar del sujeto. La pasiva con 'se' (Se venden libros) es más común en español. Las expresiones impersonales (Se dice que...) no tienen sujeto específico. La diferencia principal es que la pasiva tiene objeto mientras que la impersonal no. La voz pasiva se usa en contextos formales como escritura académica, noticias y documentos oficiales. Dominar voz pasiva e impersonales te permite expresar ideas de manera más formal y sofisticada en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Ser vs Estar: Usos Avanzados",
      "description": "Profundiza en los usos avanzados y matices de ser y estar en español. Aunque ambos significan 'to be', tienen usos muy diferentes y específicos. Dominar los usos avanzados de ser y estar te permite expresar matices sutiles y evitar errores comunes. Piensa en ser como identidad permanente y estar como estado temporal.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Ser vs Estar Avanzado: Una Guía Completa",
          "content": "Paso 1: Repasa usos básicos de ser y estar. Paso 2: Aprende usos avanzados de ser. Paso 3: Aprende usos avanzados de estar. Paso 4: Aprende matices y excepciones. Paso 5: Practica con situaciones complejas. Paso 6: Practica identificar cuándo usar cada uno. Paso 7: Practica ser vs estar avanzado. Esta guía te ayuda a dominar ser vs estar avanzado."
        },
        {
          "type": "Guía Visual",
          "title": "Ser vs Estar Avanzado",
          "content": "Dibuja diferencias: Ser (permanente) → Estar (temporal) → Matices. Muestra: Usos avanzados, Excepciones, Contextos. La guía visual ayuda a entender ser vs estar avanzado."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Ser vs Estar Avanzado",
          "content": "Actividad: Practica ser vs estar avanzado en español. Practica: Usos avanzados, Matices, Excepciones, Oraciones complejas. Practica: Fluidez, Precisión. Esta actividad mejora tu conocimiento de ser vs estar."
        }
      ],
      "key_points": [
        {
          "title": "Usos Avanzados de 'Ser' 📝",
          "content": "Ser se usa para características permanentes y definiciones. **Usos avanzados:** Definiciones (El agua es H2O), Materiales (La mesa es de madera), Origen (Soy de España), Eventos (La fiesta es mañana), Hora (Son las tres). **Cómo entenderlo:** Como características que no cambian. **Mundo real:** Estudiante usa ser: Dice 'Soy médico', Expresa identidad permanente, Ser usado correctamente. Los usos avanzados son importantes. **Mejor práctica:** Aprende usos avanzados, Identifica permanencia, Practica ser, Practica usos avanzados de ser."
        },
        {
          "title": "Usos Avanzados de 'Estar' 📄",
          "content": "Estar se usa para estados temporales y ubicación. **Usos avanzados:** Estados temporales (Estoy cansado), Ubicación (Estoy en casa), Progresivo (Estoy estudiando), Condiciones temporales (Está enfermo). **Cómo entenderlo:** Como estados que pueden cambiar. **Mundo real:** Estudiante usa estar: Dice 'Estoy cansado', Expresa estado temporal, Estar usado correctamente. Los usos avanzados son importantes. **Mejor práctica:** Aprende usos avanzados, Identifica temporalidad, Practica estar, Practica usos avanzados de estar."
        },
        {
          "title": "Matices y Excepciones ⚠️",
          "content": "Algunos casos son matizados. **Matices:** Ser aburrido (boring person) vs Estar aburrido (bored), Ser listo (smart) vs Estar listo (ready), Ser vivo (alive) vs Estar vivo (awake/alert). **Cómo entenderlo:** Como diferencias sutiles de significado. **Mundo real:** Estudiante usa matices: Usa 'ser aburrido' para persona, Usa 'estar aburrido' para sentimiento, Matices usados correctamente. Los matices son importantes. **Mejor práctica:** Aprende matices, Memoriza diferencias, Practica matices, Practica matices y excepciones."
        },
        {
          "title": "Ser + Participio vs Estar + Participio 🔄",
          "content": "Ser + participio es pasiva, estar + participio es resultado. **Ser + participio:** La puerta fue cerrada (pasiva), El libro fue escrito (pasiva). **Estar + participio:** La puerta está cerrada (resultado), El libro está escrito (resultado). **Cómo entenderlo:** Como pasiva (ser) vs resultado (estar). **Mundo real:** Estudiante diferencia: Usa 'ser cerrada' para pasiva, Usa 'estar cerrada' para resultado, Diferencia entendida. La diferencia es importante. **Mejor práctica:** Aprende diferencias, Identifica pasiva vs resultado, Practica diferencias, Practica ser + participio vs estar + participio."
        },
        {
          "title": "Contextos Específicos 🎯",
          "content": "Algunos contextos requieren ser o estar específicamente. **Ser:** Profesiones, Nacionalidades, Características físicas permanentes, Eventos. **Estar:** Emociones, Condiciones físicas temporales, Ubicación, Progresivo. **Cómo entenderlo:** Como elegir según contexto. **Mundo real:** Estudiante elige: Usa ser para profesión, Usa estar para emoción, Contexto elegido correctamente. Los contextos son importantes. **Mejor práctica:** Aprende contextos, Practica elección, Usa correctamente, Practica contextos específicos."
        }
      ],
      "examples": [
        {
          "scenario": "Uso Avanzado de Ser",
          "explanation": "Estudiante usa ser: Dice 'Soy médico', Expresa identidad permanente, Ser usado correctamente."
        },
        {
          "scenario": "Uso Avanzado de Estar",
          "explanation": "Estudiante usa estar: Dice 'Estoy cansado', Expresa estado temporal, Estar usado correctamente."
        },
        {
          "scenario": "Matices",
          "explanation": "Estudiante usa matices: Usa 'ser aburrido' para persona, Usa 'estar aburrido' para sentimiento, Matices usados correctamente."
        },
        {
          "scenario": "Ser + Participio vs Estar + Participio",
          "explanation": "Estudiante diferencia: Usa 'ser cerrada' para pasiva, Usa 'estar cerrada' para resultado, Diferencia entendida."
        }
      ],
      "exercises": [
        {
          "title": "Practica Usos Avanzados de Ser",
          "instructions": "Paso 1: Repasa usos básicos de ser. Paso 2: Aprende usos avanzados de ser. Paso 3: Practica con definiciones. Paso 4: Practica con materiales. Paso 5: Practica con eventos. Paso 6: Usa ser en oraciones complejas. Paso 7: Practica usos avanzados de ser.",
          "example_answer": "Usos avanzados de ser practicados: Usos básicos repasados, Usos avanzados aprendidos, Definiciones practicadas, Materiales practicados, Eventos practicados, Oraciones complejas creadas, Usos avanzados de ser dominados."
        },
        {
          "title": "Practica Usos Avanzados de Estar",
          "instructions": "Paso 1: Repasa usos básicos de estar. Paso 2: Aprende usos avanzados de estar. Paso 3: Practica con estados temporales. Paso 4: Practica con progresivo. Paso 5: Practica con condiciones. Paso 6: Usa estar en oraciones complejas. Paso 7: Practica usos avanzados de estar.",
          "example_answer": "Usos avanzados de estar practicados: Usos básicos repasados, Usos avanzados aprendidos, Estados temporales practicados, Progresivo practicado, Condiciones practicadas, Oraciones complejas creadas, Usos avanzados de estar dominados."
        },
        {
          "title": "Practica Matices y Diferencias",
          "instructions": "Paso 1: Aprende matices (ser aburrido vs estar aburrido). Paso 2: Aprende ser + participio vs estar + participio. Paso 3: Practica identificar diferencias. Paso 4: Practica usar matices. Paso 5: Crea oraciones con matices. Paso 6: Identifica errores comunes. Paso 7: Practica matices y diferencias.",
          "example_answer": "Matices y diferencias practicados: Matices aprendidos, Ser + participio vs estar + participio aprendido, Diferencias identificadas, Matices usados, Oraciones con matices creadas, Errores identificados, Matices y diferencias dominados."
        }
      ],
      "textbooks": [
        {
          "title": "Ser vs Estar Avanzado en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de usos avanzados de ser y estar."
        },
        {
          "title": "Gramática Española: Ser y Estar",
          "source": "OpenStax",
          "reason": "Cubre usos avanzados, matices y excepciones de ser y estar."
        }
      ],
      "videos": [
        {
          "title": "Ser vs Estar Avanzado Tutorial – Traversy Media",
          "reason": "Guía completa de usos avanzados de ser y estar en español."
        },
        {
          "title": "Ser y Estar Complejo en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre usos avanzados y matices de ser y estar."
        }
      ],
      "summary": "Ser se usa para características permanentes (Soy médico), definiciones, materiales, origen y eventos. Estar se usa para estados temporales (Estoy cansado), ubicación, progresivo y condiciones temporales. Hay matices importantes: ser aburrido (boring person) vs estar aburrido (bored), ser listo (smart) vs estar listo (ready). Ser + participio forma voz pasiva (fue cerrada) mientras que estar + participio expresa resultado (está cerrada). Dominar los usos avanzados de ser y estar te permite expresar matices sutiles y evitar errores comunes en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Escritura Académica y Formal",
      "description": "Aprende a escribir en español de manera académica y formal. La escritura académica requiere un estilo específico, vocabulario formal y estructuras complejas. Dominar la escritura académica te permite escribir ensayos, informes y documentos profesionales en español. Piensa en la escritura académica como comunicación precisa y sofisticada.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Escritura Académica: Una Guía Completa",
          "content": "Paso 1: Aprende estructura de ensayo académico. Paso 2: Aprende vocabulario formal. Paso 3: Aprende conectores avanzados. Paso 4: Aprende citas y referencias. Paso 5: Practica escribir párrafos formales. Paso 6: Practica escribir ensayos completos. Paso 7: Practica escritura académica. Esta guía te ayuda a dominar escritura académica."
        },
        {
          "type": "Guía Visual",
          "title": "Escritura Académica",
          "content": "Dibuja estructura: Introducción → Desarrollo → Conclusión. Muestra: Estructura, Vocabulario, Conectores. La guía visual ayuda a entender escritura académica."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Escritura Académica",
          "content": "Actividad: Practica escritura académica en español. Practica: Estructura, Vocabulario, Conectores, Ensayos. Practica: Precisión, Sofisticación. Esta actividad mejora tus habilidades de escritura académica."
        }
      ],
      "key_points": [
        {
          "title": "Estructura de Ensayo Académico 📝",
          "content": "Los ensayos académicos tienen estructura específica. **Estructura:** Introducción (presenta tema), Desarrollo (argumentos), Conclusión (resumen). **Cómo entenderlo:** Como organizar ideas formalmente. **Mundo real:** Estudiante escribe ensayo: Escribe introducción, Desarrolla argumentos, Concluye, Ensayo estructurado. La estructura es importante. **Mejor práctica:** Aprende estructura, Organiza ideas, Practica estructura, Practica estructura de ensayo académico."
        },
        {
          "title": "Vocabulario Formal 📚",
          "content": "El vocabulario formal es esencial. **Vocabulario:** Por consiguiente (therefore), No obstante (nevertheless), Asimismo (likewise), En consecuencia (consequently). **Cómo entenderlo:** Como palabras formales y precisas. **Mundo real:** Estudiante usa vocabulario: Usa 'por consiguiente', Expresa formalidad, Vocabulario usado correctamente. El vocabulario formal es importante. **Mejor práctica:** Aprende vocabulario, Usa en escritura, Practica vocabulario, Practica vocabulario formal."
        },
        {
          "title": "Conectores Avanzados 🔗",
          "content": "Los conectores unen ideas complejas. **Conectores:** Sin embargo (however), Por otra parte (on the other hand), En primer lugar (firstly), Finalmente (finally). **Cómo entenderlo:** Como palabras que conectan ideas. **Mundo real:** Estudiante usa conectores: Usa 'sin embargo', Conecta ideas, Conectores usados correctamente. Los conectores son importantes. **Mejor práctica:** Aprende conectores, Usa para conectar, Practica conectores, Practica conectores avanzados."
        },
        {
          "title": "Citas y Referencias 📄",
          "content": "Las citas dan credibilidad. **Formato:** Según (According to), Como afirma (As states), En palabras de (In the words of). **Cómo entenderlo:** Como referenciar fuentes. **Mundo real:** Estudiante cita: Usa 'según', Referencia fuente, Citas usadas correctamente. Las citas son importantes. **Mejor práctica:** Aprende formato, Usa citas, Practica referencias, Practica citas y referencias."
        },
        {
          "title": "Estilo Objetivo 🎯",
          "content": "El estilo académico es objetivo. **Características:** Tercera persona, Voz pasiva, Evitar opiniones personales, Hechos y evidencia. **Cómo entenderlo:** Como escribir objetivamente. **Mundo real:** Estudiante escribe: Usa tercera persona, Expresa objetividad, Estilo objetivo usado. El estilo objetivo es importante. **Mejor práctica:** Aprende características, Usa tercera persona, Practica objetividad, Practica estilo objetivo."
        }
      ],
      "examples": [
        {
          "scenario": "Estructura",
          "explanation": "Estudiante escribe: Escribe introducción, Desarrolla argumentos, Concluye, Ensayo estructurado correctamente."
        },
        {
          "scenario": "Vocabulario Formal",
          "explanation": "Estudiante usa vocabulario: Usa 'por consiguiente', Expresa formalidad, Vocabulario usado correctamente."
        },
        {
          "scenario": "Conectores",
          "explanation": "Estudiante usa conectores: Usa 'sin embargo', Conecta ideas, Conectores usados correctamente."
        },
        {
          "scenario": "Estilo Objetivo",
          "explanation": "Estudiante escribe: Usa tercera persona, Expresa objetividad, Estilo objetivo usado."
        }
      ],
      "exercises": [
        {
          "title": "Practica Estructura de Ensayo",
          "instructions": "Paso 1: Aprende estructura de ensayo académico. Paso 2: Practica escribir introducción. Paso 3: Practica escribir desarrollo. Paso 4: Practica escribir conclusión. Paso 5: Escribe ensayo completo. Paso 6: Revisa estructura. Paso 7: Practica estructura de ensayo.",
          "example_answer": "Estructura de ensayo practicada: Estructura aprendida, Introducción escrita, Desarrollo escrito, Conclusión escrita, Ensayo completo escrito, Estructura revisada, Estructura de ensayo dominada."
        },
        {
          "title": "Practica Vocabulario y Conectores",
          "instructions": "Paso 1: Aprende vocabulario formal. Paso 2: Aprende conectores avanzados. Paso 3: Practica usar vocabulario. Paso 4: Practica usar conectores. Paso 5: Usa en escritura. Paso 6: Crea oraciones formales. Paso 7: Practica vocabulario y conectores.",
          "example_answer": "Vocabulario y conectores practicados: Vocabulario aprendido, Conectores aprendidos, Vocabulario usado, Conectores usados, Escritura con vocabulario y conectores, Oraciones formales creadas, Vocabulario y conectores dominados."
        },
        {
          "title": "Practica Escritura Académica Completa",
          "instructions": "Paso 1: Repasa estructura, vocabulario y conectores. Paso 2: Aprende citas y referencias. Paso 3: Practica estilo objetivo. Paso 4: Escribe ensayo académico completo. Paso 5: Revisa y edita. Paso 6: Practica con diferentes temas. Paso 7: Practica escritura académica completa.",
          "example_answer": "Escritura académica completa practicada: Estructura repasada, Citas aprendidas, Estilo objetivo practicado, Ensayo completo escrito, Revisado y editado, Diferentes temas practicados, Escritura académica completa dominada."
        }
      ],
      "textbooks": [
        {
          "title": "Escritura Académica en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de escritura académica en español."
        },
        {
          "title": "Redacción Académica en Español",
          "source": "OpenStax",
          "reason": "Cubre escritura académica, estructura y estilo formal."
        }
      ],
      "videos": [
        {
          "title": "Escritura Académica Tutorial – Traversy Media",
          "reason": "Guía completa de escritura académica en español."
        },
        {
          "title": "Redacción Formal en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre escritura académica y formal."
        }
      ],
      "summary": "La escritura académica requiere estructura específica (introducción, desarrollo, conclusión), vocabulario formal (por consiguiente, no obstante, asimismo) y conectores avanzados (sin embargo, por otra parte, en primer lugar). Las citas y referencias (según, como afirma) dan credibilidad. El estilo académico es objetivo, usa tercera persona y voz pasiva, y evita opiniones personales. Dominar la escritura académica te permite escribir ensayos, informes y documentos profesionales con precisión y sofisticación en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Literatura y Análisis de Textos",
      "description": "Aprende a analizar textos literarios en español. El análisis literario requiere entender temas, símbolos, personajes y técnicas literarias. Dominar el análisis literario te permite apreciar y discutir literatura en español. Piensa en el análisis literario como explorar las capas de significado en textos.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Análisis Literario: Una Guía Completa",
          "content": "Paso 1: Aprende elementos literarios (tema, personajes, símbolos). Paso 2: Aprende técnicas literarias (metáfora, símil, personificación). Paso 3: Aprende vocabulario literario. Paso 4: Practica identificar elementos. Paso 5: Practica analizar textos. Paso 6: Practica escribir análisis. Paso 7: Practica análisis literario. Esta guía te ayuda a dominar análisis literario."
        },
        {
          "type": "Guía Visual",
          "title": "Análisis Literario",
          "content": "Dibuja análisis: Elementos → Técnicas → Análisis. Muestra: Tema, Personajes, Símbolos, Técnicas. La guía visual ayuda a entender análisis literario."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Análisis Literario",
          "content": "Actividad: Practica análisis literario en español. Practica: Elementos, Técnicas, Vocabulario, Análisis. Practica: Comprensión, Interpretación. Esta actividad mejora tus habilidades de análisis literario."
        }
      ],
      "key_points": [
        {
          "title": "Elementos Literarios 📚",
          "content": "Los elementos literarios son fundamentales. **Elementos:** Tema (theme), Personajes (characters), Trama (plot), Escenario (setting), Narrador (narrator). **Cómo entenderlo:** Como componentes básicos de literatura. **Mundo real:** Estudiante analiza: Identifica tema, Analiza personajes, Elementos identificados. Los elementos son importantes. **Mejor práctica:** Aprende elementos, Identifica en textos, Practica elementos, Practica elementos literarios."
        },
        {
          "title": "Técnicas Literarias ✍️",
          "content": "Las técnicas literarias añaden profundidad. **Técnicas:** Metáfora (metaphor), Símil (simile), Personificación (personification), Hipérbole (hyperbole), Ironía (irony). **Cómo entenderlo:** Como herramientas del escritor. **Mundo real:** Estudiante identifica: Identifica metáfora, Reconoce técnica, Técnicas identificadas. Las técnicas son importantes. **Mejor práctica:** Aprende técnicas, Identifica en textos, Practica técnicas, Practica técnicas literarias."
        },
        {
          "title": "Vocabulario Literario 📝",
          "content": "El vocabulario literario es específico. **Vocabulario:** Protagonista (protagonist), Antagonista (antagonist), Clímax (climax), Resolución (resolution), Símbolo (symbol). **Cómo entenderlo:** Como palabras del análisis literario. **Mundo real:** Estudiante usa vocabulario: Usa 'protagonista', Expresa análisis, Vocabulario usado correctamente. El vocabulario es importante. **Mejor práctica:** Aprende vocabulario, Usa en análisis, Practica vocabulario, Practica vocabulario literario."
        },
        {
          "title": "Análisis de Tema 🎯",
          "content": "El tema es el mensaje central. **Análisis:** Identificar tema principal, Analizar desarrollo del tema, Relacionar con elementos. **Cómo entenderlo:** Como encontrar el mensaje. **Mundo real:** Estudiante analiza: Identifica tema, Analiza desarrollo, Tema analizado. El análisis de tema es importante. **Mejor práctica:** Aprende análisis, Identifica temas, Practica análisis, Practica análisis de tema."
        },
        {
          "title": "Interpretación y Crítica 💭",
          "content": "La interpretación añade profundidad. **Habilidades:** Interpretar símbolos, Analizar personajes, Evaluar técnicas, Formar opiniones críticas. **Cómo entenderlo:** Como ir más allá del texto. **Mundo real:** Estudiante interpreta: Interpreta símbolos, Analiza personajes, Interpretación realizada. La interpretación es avanzada. **Mejor práctica:** Aprende habilidades, Practica interpretación, Desarrolla crítica, Practica interpretación y crítica."
        }
      ],
      "examples": [
        {
          "scenario": "Elementos Literarios",
          "explanation": "Estudiante analiza: Identifica tema, Analiza personajes, Elementos identificados correctamente."
        },
        {
          "scenario": "Técnicas Literarias",
          "explanation": "Estudiante identifica: Identifica metáfora, Reconoce técnica, Técnicas identificadas."
        },
        {
          "scenario": "Análisis de Tema",
          "explanation": "Estudiante analiza: Identifica tema principal, Analiza desarrollo, Tema analizado."
        },
        {
          "scenario": "Interpretación",
          "explanation": "Estudiante interpreta: Interpreta símbolos, Analiza personajes, Interpretación realizada."
        }
      ],
      "exercises": [
        {
          "title": "Practica Identificar Elementos",
          "instructions": "Paso 1: Aprende elementos literarios. Paso 2: Practica identificar tema. Paso 3: Practica identificar personajes. Paso 4: Practica identificar trama. Paso 5: Practica identificar escenario. Paso 6: Analiza textos completos. Paso 7: Practica identificar elementos.",
          "example_answer": "Elementos identificados: Elementos aprendidos, Tema identificado, Personajes identificados, Trama identificada, Escenario identificado, Textos analizados, Elementos identificados correctamente."
        },
        {
          "title": "Practica Técnicas Literarias",
          "instructions": "Paso 1: Aprende técnicas literarias. Paso 2: Practica identificar metáforas. Paso 3: Practica identificar símiles. Paso 4: Practica identificar personificación. Paso 5: Practica identificar otras técnicas. Paso 6: Analiza uso de técnicas. Paso 7: Practica técnicas literarias.",
          "example_answer": "Técnicas literarias practicadas: Técnicas aprendidas, Metáforas identificadas, Símiles identificados, Personificación identificada, Otras técnicas identificadas, Uso analizado, Técnicas literarias dominadas."
        },
        {
          "title": "Practica Análisis Completo",
          "instructions": "Paso 1: Repasa elementos y técnicas. Paso 2: Aprende vocabulario literario. Paso 3: Practica análisis de tema. Paso 4: Practica interpretación. Paso 5: Escribe análisis completo. Paso 6: Practica con diferentes textos. Paso 7: Practica análisis completo.",
          "example_answer": "Análisis completo practicado: Elementos y técnicas repasados, Vocabulario aprendido, Análisis de tema practicado, Interpretación practicada, Análisis completo escrito, Diferentes textos analizados, Análisis completo dominado."
        }
      ],
      "textbooks": [
        {
          "title": "Análisis Literario en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de análisis literario en español."
        },
        {
          "title": "Literatura Española: Análisis",
          "source": "OpenStax",
          "reason": "Cubre análisis literario, elementos y técnicas."
        }
      ],
      "videos": [
        {
          "title": "Análisis Literario Tutorial – Traversy Media",
          "reason": "Guía completa de análisis literario en español."
        },
        {
          "title": "Literatura en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre análisis literario y literatura."
        }
      ],
      "summary": "El análisis literario requiere entender elementos literarios (tema, personajes, trama, escenario, narrador) y técnicas literarias (metáfora, símil, personificación, hipérbole, ironía). El vocabulario literario (protagonista, antagonista, clímax, resolución, símbolo) es esencial. El análisis de tema identifica el mensaje central y su desarrollo. La interpretación y crítica van más allá del texto para analizar símbolos, personajes y técnicas. Dominar el análisis literario te permite apreciar y discutir literatura en español con profundidad y sofisticación."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Español de Negocios y Profesional",
      "description": "Aprende vocabulario y expresiones para contextos profesionales y de negocios en español. El español de negocios requiere vocabulario específico, formalidad y conocimiento cultural. Dominar el español de negocios te permite comunicarte efectivamente en entornos profesionales. Piensa en el español de negocios como comunicación profesional y culturalmente apropiada.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Español de Negocios: Una Guía Completa",
          "content": "Paso 1: Aprende vocabulario de negocios. Paso 2: Aprende frases profesionales. Paso 3: Aprende correspondencia comercial. Paso 4: Aprende presentaciones de negocios. Paso 5: Aprende negociación. Paso 6: Practica con situaciones profesionales. Paso 7: Practica español de negocios. Esta guía te ayuda a dominar español de negocios."
        },
        {
          "type": "Guía Visual",
          "title": "Español de Negocios",
          "content": "Dibuja negocios: Vocabulario → Correspondencia → Presentaciones → Negociación. Muestra: Vocabulario, Frases, Contextos. La guía visual ayuda a entender español de negocios."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Español de Negocios",
          "content": "Actividad: Practica español de negocios. Practica: Vocabulario, Frases, Correspondencia, Presentaciones. Practica: Profesionalismo, Efectividad. Esta actividad mejora tu español de negocios."
        }
      ],
      "key_points": [
        {
          "title": "Vocabulario de Negocios 💼",
          "content": "El vocabulario de negocios es específico. **Vocabulario:** Reunión (meeting), Contrato (contract), Cliente (client), Presupuesto (budget), Beneficio (profit). **Cómo entenderlo:** Como palabras del mundo empresarial. **Mundo real:** Estudiante usa vocabulario: Usa 'reunión', Habla de negocios, Vocabulario usado correctamente. El vocabulario es importante. **Mejor práctica:** Aprende vocabulario, Usa en contextos, Practica vocabulario, Practica vocabulario de negocios."
        },
        {
          "title": "Correspondencia Comercial 📧",
          "content": "La correspondencia comercial tiene formato específico. **Elementos:** Saludo formal, Cuerpo del mensaje, Cierre profesional, Firma. **Frases:** Le escribo para..., Quedo a su disposición, Atentamente. **Cómo entenderlo:** Como escribir emails profesionales. **Mundo real:** Estudiante escribe: Usa formato formal, Escribe profesionalmente, Correspondencia escrita. La correspondencia es importante. **Mejor práctica:** Aprende formato, Usa frases formales, Practica correspondencia, Practica correspondencia comercial."
        },
        {
          "title": "Presentaciones de Negocios 📊",
          "content": "Las presentaciones requieren estructura y vocabulario específico. **Estructura:** Introducción, Desarrollo, Conclusión. **Frases:** En primer lugar (firstly), Por otra parte (on the other hand), En conclusión (in conclusion). **Cómo entenderlo:** Como presentar profesionalmente. **Mundo real:** Estudiante presenta: Usa estructura, Presenta profesionalmente, Presentación realizada. Las presentaciones son importantes. **Mejor práctica:** Aprende estructura, Usa frases, Practica presentaciones, Practica presentaciones de negocios."
        },
        {
          "title": "Negociación y Reuniones 🤝",
          "content": "Las negociaciones requieren habilidades específicas. **Frases:** Propongo que... (I propose that...), Estoy de acuerdo (I agree), No estoy de acuerdo (I disagree), ¿Qué opina usted? (What do you think?). **Cómo entenderlo:** Como negociar profesionalmente. **Mundo real:** Estudiante negocia: Usa frases profesionales, Negocia efectivamente, Negociación realizada. La negociación es importante. **Mejor práctica:** Aprende frases, Practica negociación, Usa profesionalmente, Practica negociación y reuniones."
        },
        {
          "title": "Cultura Empresarial 🌍",
          "content": "La cultura empresarial varía por región. **Aspectos:** Formalidad, Horarios, Relaciones personales, Comunicación. **Cómo entenderlo:** Como adaptarse culturalmente. **Mundo real:** Estudiante adapta: Respeta formalidad, Entiende cultura, Cultura entendida. La cultura es importante. **Mejor práctica:** Aprende aspectos, Respeta cultura, Practica adaptación, Practica cultura empresarial."
        }
      ],
      "examples": [
        {
          "scenario": "Vocabulario de Negocios",
          "explanation": "Estudiante usa vocabulario: Usa 'reunión', Habla de negocios, Vocabulario usado correctamente."
        },
        {
          "scenario": "Correspondencia",
          "explanation": "Estudiante escribe: Usa formato formal, Escribe profesionalmente, Correspondencia escrita."
        },
        {
          "scenario": "Presentación",
          "explanation": "Estudiante presenta: Usa estructura, Presenta profesionalmente, Presentación realizada."
        },
        {
          "scenario": "Negociación",
          "explanation": "Estudiante negocia: Usa frases profesionales, Negocia efectivamente, Negociación realizada."
        }
      ],
      "exercises": [
        {
          "title": "Practica Vocabulario de Negocios",
          "instructions": "Paso 1: Aprende vocabulario de negocios. Paso 2: Practica pronunciar vocabulario. Paso 3: Usa vocabulario en oraciones. Paso 4: Practica con diferentes contextos. Paso 5: Crea oraciones profesionales. Paso 6: Practica vocabulario. Paso 7: Practica vocabulario de negocios.",
          "example_answer": "Vocabulario de negocios practicado: Vocabulario aprendido, Pronunciado, Oraciones con vocabulario, Diferentes contextos practicados, Oraciones profesionales creadas, Vocabulario dominado."
        },
        {
          "title": "Practica Correspondencia y Presentaciones",
          "instructions": "Paso 1: Aprende formato de correspondencia. Paso 2: Aprende estructura de presentaciones. Paso 3: Practica escribir emails profesionales. Paso 4: Practica hacer presentaciones. Paso 5: Usa frases formales. Paso 6: Practica con diferentes situaciones. Paso 7: Practica correspondencia y presentaciones.",
          "example_answer": "Correspondencia y presentaciones practicadas: Formato aprendido, Estructura aprendida, Emails escritos, Presentaciones hechas, Frases formales usadas, Diferentes situaciones practicadas, Correspondencia y presentaciones dominadas."
        },
        {
          "title": "Practica Negociación y Cultura",
          "instructions": "Paso 1: Aprende frases de negociación. Paso 2: Aprende aspectos culturales. Paso 3: Practica negociación. Paso 4: Practica adaptación cultural. Paso 5: Crea diálogos de negocios. Paso 6: Practica con situaciones reales. Paso 7: Practica negociación y cultura.",
          "example_answer": "Negociación y cultura practicadas: Frases aprendidas, Aspectos culturales aprendidos, Negociación practicada, Adaptación cultural practicada, Diálogos creados, Situaciones reales practicadas, Negociación y cultura dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Español de Negocios",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de español de negocios y profesional."
        },
        {
          "title": "Comunicación Empresarial en Español",
          "source": "OpenStax",
          "reason": "Cubre vocabulario de negocios, correspondencia y cultura empresarial."
        }
      ],
      "videos": [
        {
          "title": "Español de Negocios Tutorial – Traversy Media",
          "reason": "Guía completa de español de negocios."
        },
        {
          "title": "Comunicación Profesional en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre español de negocios y profesional."
        }
      ],
      "summary": "El español de negocios requiere vocabulario específico (reunión, contrato, cliente, presupuesto, beneficio) y frases profesionales. La correspondencia comercial tiene formato específico con saludos formales y cierres profesionales. Las presentaciones de negocios requieren estructura clara y vocabulario apropiado. La negociación y reuniones usan frases específicas (Propongo que..., Estoy de acuerdo, ¿Qué opina usted?). La cultura empresarial varía por región y requiere adaptación. Dominar el español de negocios te permite comunicarte efectivamente en entornos profesionales y culturalmente apropiados en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Variaciones Regionales del Español",
      "description": "Aprende sobre las variaciones regionales del español en diferentes países. El español tiene muchas variantes (español de España, mexicano, argentino, colombiano, etc.) con diferencias en vocabulario, pronunciación y gramática. Entender variaciones regionales te permite comunicarte efectivamente con hablantes de diferentes países. Piensa en las variaciones como diferentes acentos y expresiones del mismo idioma.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Variaciones Regionales: Una Guía Completa",
          "content": "Paso 1: Aprende diferencias de vocabulario. Paso 2: Aprende diferencias de pronunciación. Paso 3: Aprende diferencias gramaticales. Paso 4: Aprende expresiones regionales. Paso 5: Practica identificar variaciones. Paso 6: Practica adaptar tu español. Paso 7: Practica variaciones regionales. Esta guía te ayuda a entender variaciones regionales."
        },
        {
          "type": "Guía Visual",
          "title": "Variaciones Regionales",
          "content": "Dibuja variaciones: España → México → Argentina → Colombia. Muestra: Vocabulario, Pronunciación, Expresiones. La guía visual ayuda a entender variaciones regionales."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Variaciones Regionales",
          "content": "Actividad: Practica variaciones regionales del español. Practica: Vocabulario, Pronunciación, Expresiones, Adaptación. Practica: Comprensión, Flexibilidad. Esta actividad mejora tu conocimiento de variaciones regionales."
        }
      ],
      "key_points": [
        {
          "title": "Diferencias de Vocabulario 📝",
          "content": "El vocabulario varía significativamente. **Ejemplos:** España: Ordenador (computer), México: Computadora, Argentina: Computadora. España: Móvil (phone), México: Celular, Argentina: Celular. **Cómo entenderlo:** Como diferentes palabras para lo mismo. **Mundo real:** Estudiante adapta: Usa 'computadora' en México, Usa 'ordenador' en España, Vocabulario adaptado. Las diferencias son importantes. **Mejor práctica:** Aprende diferencias, Adapta vocabulario, Practica variaciones, Practica diferencias de vocabulario."
        },
        {
          "title": "Diferencias de Pronunciación 🗣️",
          "content": "La pronunciación varía por región. **Diferencias:** España: 'c' y 'z' como 'th', América: 'c' y 'z' como 's'. España: 'll' como 'y', Argentina: 'll' como 'sh'. **Cómo entenderlo:** Como diferentes sonidos. **Mundo real:** Estudiante adapta: Pronuncia según región, Entiende variaciones, Pronunciación adaptada. Las diferencias son importantes. **Mejor práctica:** Aprende diferencias, Practica pronunciación, Adapta según región, Practica diferencias de pronunciación."
        },
        {
          "title": "Diferencias Gramaticales 📚",
          "content": "Algunas diferencias gramaticales existen. **Diferencias:** España: Vosotros (you plural), América: Ustedes. España: Presente perfecto más común, América: Pretérito más común. **Cómo entenderlo:** Como diferentes usos gramaticales. **Mundo real:** Estudiante adapta: Usa 'ustedes' en América, Usa 'vosotros' en España, Gramática adaptada. Las diferencias son importantes. **Mejor práctica:** Aprende diferencias, Adapta gramática, Practica variaciones, Practica diferencias gramaticales."
        },
        {
          "title": "Expresiones Regionales 💬",
          "content": "Cada región tiene expresiones únicas. **Ejemplos:** México: ¿Qué onda? (What's up?), Argentina: ¿Che, cómo andás? (Hey, how are you?), España: ¿Qué tal? (How's it going?). **Cómo entenderlo:** Como expresiones locales. **Mundo real:** Estudiante aprende: Aprende expresiones regionales, Usa apropiadamente, Expresiones aprendidas. Las expresiones son útiles. **Mejor práctica:** Aprende expresiones, Usa apropiadamente, Practica expresiones, Practica expresiones regionales."
        },
        {
          "title": "Adaptación y Comprensión 🌍",
          "content": "Entender variaciones mejora la comunicación. **Habilidades:** Reconocer variaciones, Adaptar vocabulario, Entender diferentes acentos, Respetar diferencias. **Cómo entenderlo:** Como ser flexible con el español. **Mundo real:** Estudiante adapta: Reconoce variaciones, Adapta comunicación, Adaptación realizada. La adaptación es importante. **Mejor práctica:** Aprende habilidades, Practica reconocimiento, Adapta comunicación, Practica adaptación y comprensión."
        }
      ],
      "examples": [
        {
          "scenario": "Vocabulario",
          "explanation": "Estudiante adapta: Usa 'computadora' en México, Usa 'ordenador' en España, Vocabulario adaptado correctamente."
        },
        {
          "scenario": "Pronunciación",
          "explanation": "Estudiante adapta: Pronuncia según región, Entiende variaciones, Pronunciación adaptada."
        },
        {
          "scenario": "Expresiones",
          "explanation": "Estudiante aprende: Aprende '¿Qué onda?' en México, Usa apropiadamente, Expresiones aprendidas."
        },
        {
          "scenario": "Adaptación",
          "explanation": "Estudiante adapta: Reconoce variaciones, Adapta comunicación, Adaptación realizada."
        }
      ],
      "exercises": [
        {
          "title": "Practica Diferencias de Vocabulario",
          "instructions": "Paso 1: Aprende vocabulario de España. Paso 2: Aprende vocabulario de México. Paso 3: Aprende vocabulario de Argentina. Paso 4: Aprende vocabulario de otros países. Paso 5: Practica identificar diferencias. Paso 6: Practica adaptar vocabulario. Paso 7: Practica diferencias de vocabulario.",
          "example_answer": "Diferencias de vocabulario practicadas: Vocabulario de España aprendido, Vocabulario de México aprendido, Vocabulario de Argentina aprendido, Otros países aprendidos, Diferencias identificadas, Vocabulario adaptado, Diferencias de vocabulario dominadas."
        },
        {
          "title": "Practica Pronunciación y Gramática",
          "instructions": "Paso 1: Aprende diferencias de pronunciación. Paso 2: Aprende diferencias gramaticales. Paso 3: Practica pronunciación de diferentes regiones. Paso 4: Practica uso gramatical. Paso 5: Practica identificar variaciones. Paso 6: Practica adaptación. Paso 7: Practica pronunciación y gramática.",
          "example_answer": "Pronunciación y gramática practicadas: Diferencias de pronunciación aprendidas, Diferencias gramaticales aprendidas, Pronunciación practicada, Uso gramatical practicado, Variaciones identificadas, Adaptación practicada, Pronunciación y gramática dominadas."
        },
        {
          "title": "Practica Expresiones y Adaptación",
          "instructions": "Paso 1: Aprende expresiones regionales. Paso 2: Practica usar expresiones. Paso 3: Practica reconocer variaciones. Paso 4: Practica adaptar comunicación. Paso 5: Practica con diferentes regiones. Paso 6: Desarrolla flexibilidad. Paso 7: Practica expresiones y adaptación.",
          "example_answer": "Expresiones y adaptación practicadas: Expresiones aprendidas, Expresiones usadas, Variaciones reconocidas, Comunicación adaptada, Diferentes regiones practicadas, Flexibilidad desarrollada, Expresiones y adaptación dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Variaciones del Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de variaciones regionales del español."
        },
        {
          "title": "Español: Variantes Regionales",
          "source": "OpenStax",
          "reason": "Cubre diferencias de vocabulario, pronunciación y gramática regional."
        }
      ],
      "videos": [
        {
          "title": "Variaciones Regionales Tutorial – Traversy Media",
          "reason": "Guía completa de variaciones regionales del español."
        },
        {
          "title": "Español de Diferentes Países – freeCodeCamp",
          "reason": "Tutorial completo sobre variaciones regionales del español."
        }
      ],
      "summary": "El español tiene muchas variantes regionales con diferencias en vocabulario (ordenador vs computadora), pronunciación (c/z como 'th' en España vs 's' en América) y gramática (vosotros en España vs ustedes en América). Cada región tiene expresiones únicas (¿Qué onda? en México, ¿Che, cómo andás? en Argentina). Entender y adaptarse a variaciones regionales mejora la comunicación y muestra respeto cultural. Dominar las variaciones regionales del español te permite comunicarte efectivamente con hablantes de diferentes países y entender la rica diversidad del idioma español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Debate y Argumentación",
      "description": "Aprende a debatir y argumentar efectivamente en español. El debate requiere estructurar argumentos, presentar evidencia y refutar contraargumentos. Dominar el debate y la argumentación te permite participar en discusiones académicas y profesionales. Piensa en el debate como comunicación persuasiva y estructurada.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Debate: Una Guía Completa",
          "content": "Paso 1: Aprende estructura de argumento. Paso 2: Aprende frases de debate. Paso 3: Aprende presentar evidencia. Paso 4: Aprende refutar argumentos. Paso 5: Practica estructurar argumentos. Paso 6: Practica debatir. Paso 7: Practica debate y argumentación. Esta guía te ayuda a dominar debate y argumentación."
        },
        {
          "type": "Guía Visual",
          "title": "Debate y Argumentación",
          "content": "Dibuja debate: Estructura → Argumentos → Evidencia → Refutación. Muestra: Técnicas, Frases, Estrategias. La guía visual ayuda a entender debate y argumentación."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Debate",
          "content": "Actividad: Practica debate en español. Practica: Estructura, Argumentos, Evidencia, Refutación. Practica: Persuasión, Claridad. Esta actividad mejora tus habilidades de debate."
        }
      ],
      "key_points": [
        {
          "title": "Estructura de Argumento 📝",
          "content": "Los argumentos tienen estructura específica. **Estructura:** Tesis (claim), Razones (reasons), Evidencia (evidence), Conclusión (conclusion). **Cómo entenderlo:** Como organizar ideas persuasivamente. **Mundo real:** Estudiante argumenta: Presenta tesis, Da razones, Proporciona evidencia, Concluye, Argumento estructurado. La estructura es importante. **Mejor práctica:** Aprende estructura, Organiza argumentos, Practica estructura, Practica estructura de argumento."
        },
        {
          "title": "Frases de Debate 💬",
          "content": "Las frases de debate son esenciales. **Frases:** En mi opinión (In my opinion), Estoy de acuerdo porque... (I agree because...), No estoy de acuerdo porque... (I disagree because...), Por un lado... por otro lado (On one hand... on the other hand). **Cómo entenderlo:** Como expresar opiniones y argumentos. **Mundo real:** Estudiante debate: Usa frases de debate, Expresa argumentos, Debate realizado. Las frases son importantes. **Mejor práctica:** Aprende frases, Usa en debate, Practica frases, Practica frases de debate."
        },
        {
          "title": "Presentar Evidencia 📊",
          "content": "La evidencia fortalece argumentos. **Tipos:** Estadísticas, Ejemplos, Testimonios, Datos. **Frases:** Según los datos (According to the data), Por ejemplo (For example), Los estudios muestran (Studies show). **Cómo entenderlo:** Como apoyar argumentos con evidencia. **Mundo real:** Estudiante presenta: Usa evidencia, Fortalece argumento, Evidencia presentada. La evidencia es importante. **Mejor práctica:** Aprende tipos, Usa evidencia, Practica presentación, Practica presentar evidencia."
        },
        {
          "title": "Refutar Argumentos 🔄",
          "content": "Refutar argumentos es parte del debate. **Técnicas:** Reconocer punto de vista opuesto, Presentar contraargumentos, Proporcionar evidencia contraria. **Frases:** Aunque entiendo tu punto (Although I understand your point), Sin embargo (However), Por el contrario (On the contrary). **Cómo entenderlo:** Como responder a argumentos opuestos. **Mundo real:** Estudiante refuta: Reconoce punto opuesto, Presenta contraargumento, Refutación realizada. La refutación es importante. **Mejor práctica:** Aprende técnicas, Practica refutación, Usa frases, Practica refutar argumentos."
        },
        {
          "title": "Estrategias de Persuasión 🎯",
          "content": "Las estrategias mejoran la persuasión. **Estrategias:** Usar lógica, Apelar a emociones, Usar ejemplos concretos, Estructurar claramente. **Cómo entenderlo:** Como persuadir efectivamente. **Mundo real:** Estudiante persuade: Usa lógica, Apela a emociones, Persuasión realizada. Las estrategias son importantes. **Mejor práctica:** Aprende estrategias, Practica persuasión, Usa técnicas, Practica estrategias de persuasión."
        }
      ],
      "examples": [
        {
          "scenario": "Estructura de Argumento",
          "explanation": "Estudiante argumenta: Presenta tesis, Da razones, Proporciona evidencia, Concluye, Argumento estructurado correctamente."
        },
        {
          "scenario": "Presentar Evidencia",
          "explanation": "Estudiante presenta: Usa estadísticas, Fortalece argumento, Evidencia presentada."
        },
        {
          "scenario": "Refutar",
          "explanation": "Estudiante refuta: Reconoce punto opuesto, Presenta contraargumento, Refutación realizada."
        },
        {
          "scenario": "Persuasión",
          "explanation": "Estudiante persuade: Usa lógica, Apela a emociones, Persuasión realizada."
        }
      ],
      "exercises": [
        {
          "title": "Practica Estructura de Argumento",
          "instructions": "Paso 1: Aprende estructura de argumento. Paso 2: Practica presentar tesis. Paso 3: Practica dar razones. Paso 4: Practica proporcionar evidencia. Paso 5: Practica concluir. Paso 6: Escribe argumento completo. Paso 7: Practica estructura de argumento.",
          "example_answer": "Estructura de argumento practicada: Estructura aprendida, Tesis presentada, Razones dadas, Evidencia proporcionada, Conclusión escrita, Argumento completo escrito, Estructura de argumento dominada."
        },
        {
          "title": "Practica Debate y Refutación",
          "instructions": "Paso 1: Aprende frases de debate. Paso 2: Aprende técnicas de refutación. Paso 3: Practica presentar argumentos. Paso 4: Practica refutar argumentos. Paso 5: Practica debatir. Paso 6: Practica con diferentes temas. Paso 7: Practica debate y refutación.",
          "example_answer": "Debate y refutación practicados: Frases aprendidas, Técnicas aprendidas, Argumentos presentados, Argumentos refutados, Debate realizado, Diferentes temas practicados, Debate y refutación dominados."
        },
        {
          "title": "Practica Persuasión",
          "instructions": "Paso 1: Aprende estrategias de persuasión. Paso 2: Practica usar lógica. Paso 3: Practica apelar a emociones. Paso 4: Practica usar ejemplos. Paso 5: Practica estructurar persuasivamente. Paso 6: Crea argumentos persuasivos. Paso 7: Practica persuasión.",
          "example_answer": "Persuasión practicada: Estrategias aprendidas, Lógica usada, Emociones apeladas, Ejemplos usados, Estructura persuasiva practicada, Argumentos persuasivos creados, Persuasión dominada."
        }
      ],
      "textbooks": [
        {
          "title": "Debate y Argumentación en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de debate y argumentación en español."
        },
        {
          "title": "Retórica y Persuasión en Español",
          "source": "OpenStax",
          "reason": "Cubre debate, argumentación y técnicas de persuasión."
        }
      ],
      "videos": [
        {
          "title": "Debate en Español Tutorial – Traversy Media",
          "reason": "Guía completa de debate y argumentación en español."
        },
        {
          "title": "Argumentación en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre debate y argumentación."
        }
      ],
      "summary": "El debate requiere estructura de argumento (tesis, razones, evidencia, conclusión) y frases específicas (En mi opinión, Estoy de acuerdo porque..., No estoy de acuerdo porque...). Presentar evidencia (estadísticas, ejemplos, testimonios) fortalece argumentos. Refutar argumentos requiere reconocer puntos de vista opuestos y presentar contraargumentos. Las estrategias de persuasión incluyen usar lógica, apelar a emociones y usar ejemplos concretos. Dominar el debate y la argumentación te permite participar en discusiones académicas y profesionales con claridad y persuasión en español."
    },
    {
      "course": "Spanish",
      "level": "Advanced",
      "topic": "Conversación Avanzada y Fluidez",
      "description": "Desarrolla fluidez y habilidades de conversación avanzada en español. La conversación avanzada requiere manejar temas complejos, expresar opiniones sofisticadas y mantener conversaciones naturales. Dominar la conversación avanzada te permite comunicarte con confianza en cualquier situación. Piensa en la conversación avanzada como comunicación natural y fluida sobre temas complejos.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Conversación Avanzada: Una Guía Completa",
          "content": "Paso 1: Aprende mantener conversaciones largas. Paso 2: Aprende cambiar de tema naturalmente. Paso 3: Aprende expresar opiniones complejas. Paso 4: Aprende manejar interrupciones. Paso 5: Practica fluidez. Paso 6: Practica con diferentes temas. Paso 7: Practica conversación avanzada. Esta guía te ayuda a dominar conversación avanzada."
        },
        {
          "type": "Guía Visual",
          "title": "Conversación Avanzada",
          "content": "Dibuja conversación: Fluidez → Temas complejos → Opiniones → Naturalidad. Muestra: Técnicas, Estrategias, Habilidades. La guía visual ayuda a entender conversación avanzada."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Conversación Avanzada",
          "content": "Actividad: Practica conversación avanzada en español. Practica: Fluidez, Temas complejos, Opiniones, Naturalidad. Practica: Confianza, Efectividad. Esta actividad mejora tus habilidades de conversación avanzada."
        }
      ],
      "key_points": [
        {
          "title": "Mantener Conversaciones Largas 💬",
          "content": "Las conversaciones largas requieren habilidades específicas. **Habilidades:** Hacer preguntas de seguimiento, Compartir experiencias, Desarrollar temas, Mantener interés. **Cómo entenderlo:** Como mantener conversación fluida. **Mundo real:** Estudiante conversa: Hace preguntas, Comparte experiencias, Mantiene conversación, Conversación mantenida. Las habilidades son importantes. **Mejor práctica:** Aprende habilidades, Practica mantener, Desarrolla temas, Practica mantener conversaciones largas."
        },
        {
          "title": "Cambiar de Tema Naturalmente 🔄",
          "content": "Cambiar de tema es una habilidad avanzada. **Técnicas:** Frases de transición, Referencias a temas anteriores, Preguntas relacionadas. **Frases:** Hablando de eso (Speaking of that), Por cierto (By the way), Cambiando de tema (Changing the subject). **Cómo entenderlo:** Como transicionar suavemente. **Mundo real:** Estudiante cambia: Usa frases de transición, Cambia suavemente, Tema cambiado. Las técnicas son importantes. **Mejor práctica:** Aprende técnicas, Usa frases, Practica transiciones, Practica cambiar de tema naturalmente."
        },
        {
          "title": "Expresar Opiniones Complejas 💭",
          "content": "Expresar opiniones complejas requiere vocabulario avanzado. **Habilidades:** Matizar opiniones, Presentar múltiples perspectivas, Usar lenguaje sofisticado. **Frases:** En cierta medida (To some extent), Desde mi punto de vista (From my point of view), Considero que (I consider that). **Cómo entenderlo:** Como expresar ideas complejas. **Mundo real:** Estudiante expresa: Matiza opiniones, Presenta perspectivas, Opiniones expresadas. Las habilidades son importantes. **Mejor práctica:** Aprende habilidades, Usa vocabulario, Practica expresión, Practica expresar opiniones complejas."
        },
        {
          "title": "Manejar Interrupciones y Correcciones 🔄",
          "content": "Manejar interrupciones es parte de conversaciones naturales. **Técnicas:** Reconocer interrupción, Continuar después, Pedir aclaración. **Frases:** Perdón, ¿puedo continuar? (Sorry, can I continue?), Como decía (As I was saying), ¿Me permite? (May I?). **Cómo entenderlo:** Como manejar interrupciones graciosamente. **Mundo real:** Estudiante maneja: Reconoce interrupción, Continúa después, Interrupción manejada. Las técnicas son importantes. **Mejor práctica:** Aprende técnicas, Practica manejo, Usa frases, Practica manejar interrupciones y correcciones."
        },
        {
          "title": "Fluidez y Naturalidad 🎯",
          "content": "La fluidez viene con práctica. **Características:** Hablar sin pausas largas, Usar conectores naturalmente, Expresarse con confianza. **Cómo entenderlo:** Como hablar naturalmente. **Mundo real:** Estudiante habla: Habla fluidamente, Usa conectores, Expresa confianza, Fluidez lograda. La fluidez es importante. **Mejor práctica:** Practica regularmente, Usa conectores, Desarrolla confianza, Practica fluidez y naturalidad."
        }
      ],
      "examples": [
        {
          "scenario": "Conversación Larga",
          "explanation": "Estudiante conversa: Hace preguntas de seguimiento, Comparte experiencias, Mantiene conversación, Conversación mantenida."
        },
        {
          "scenario": "Cambiar de Tema",
          "explanation": "Estudiante cambia: Usa 'por cierto', Cambia suavemente, Tema cambiado naturalmente."
        },
        {
          "scenario": "Opiniones Complejas",
          "explanation": "Estudiante expresa: Matiza opiniones, Presenta múltiples perspectivas, Opiniones expresadas."
        },
        {
          "scenario": "Fluidez",
          "explanation": "Estudiante habla: Habla sin pausas largas, Usa conectores naturalmente, Fluidez lograda."
        }
      ],
      "exercises": [
        {
          "title": "Practica Mantener Conversaciones",
          "instructions": "Paso 1: Aprende hacer preguntas de seguimiento. Paso 2: Practica compartir experiencias. Paso 3: Practica desarrollar temas. Paso 4: Practica mantener interés. Paso 5: Mantén conversación larga. Paso 6: Practica con diferentes temas. Paso 7: Practica mantener conversaciones.",
          "example_answer": "Mantener conversaciones practicado: Preguntas de seguimiento aprendidas, Experiencias compartidas, Temas desarrollados, Interés mantenido, Conversación larga mantenida, Diferentes temas practicados, Mantener conversaciones dominado."
        },
        {
          "title": "Practica Cambiar de Tema y Expresar Opiniones",
          "instructions": "Paso 1: Aprende frases de transición. Paso 2: Aprende expresar opiniones complejas. Paso 3: Practica cambiar de tema. Paso 4: Practica expresar opiniones. Paso 5: Usa vocabulario avanzado. Paso 6: Practica con diferentes situaciones. Paso 7: Practica cambiar de tema y expresar opiniones.",
          "example_answer": "Cambiar de tema y expresar opiniones practicado: Frases de transición aprendidas, Expresar opiniones aprendido, Cambiar de tema practicado, Opiniones expresadas, Vocabulario avanzado usado, Diferentes situaciones practicadas, Cambiar de tema y expresar opiniones dominado."
        },
        {
          "title": "Practica Fluidez y Naturalidad",
          "instructions": "Paso 1: Repasa todas las habilidades. Paso 2: Practica hablar sin pausas. Paso 3: Practica usar conectores. Paso 4: Practica expresar confianza. Paso 5: Mantén conversaciones naturales. Paso 6: Practica con hablantes nativos. Paso 7: Practica fluidez y naturalidad.",
          "example_answer": "Fluidez y naturalidad practicadas: Habilidades repasadas, Hablar sin pausas practicado, Conectores usados, Confianza expresada, Conversaciones naturales mantenidas, Hablantes nativos practicados, Fluidez y naturalidad dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Conversación Avanzada en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de conversación avanzada en español."
        },
        {
          "title": "Fluidez en Español",
          "source": "OpenStax",
          "reason": "Cubre conversación avanzada, fluidez y habilidades comunicativas."
        }
      ],
      "videos": [
        {
          "title": "Conversación Avanzada Tutorial – Traversy Media",
          "reason": "Guía completa de conversación avanzada en español."
        },
        {
          "title": "Fluidez en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre conversación avanzada y fluidez."
        }
      ],
      "summary": "La conversación avanzada requiere mantener conversaciones largas haciendo preguntas de seguimiento y compartiendo experiencias. Cambiar de tema naturalmente usando frases de transición (Hablando de eso, Por cierto) es una habilidad avanzada. Expresar opiniones complejas requiere matizar ideas y presentar múltiples perspectivas. Manejar interrupciones y correcciones graciosamente es parte de conversaciones naturales. La fluidez viene con práctica regular y se caracteriza por hablar sin pausas largas, usar conectores naturalmente y expresarse con confianza. Dominar la conversación avanzada te permite comunicarte con confianza y naturalidad en cualquier situación en español."
    }
  ]
}

