{
  "level": "Basic",
  "topics": [
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "El Alfabeto Español y la Pronunciación",
      "description": "Aprende el alfabeto español de 27 letras y las reglas de pronunciación. El español tiene sonidos únicos como la 'ñ', la 'll', y la 'rr' que son esenciales para hablar correctamente. Dominar la pronunciación desde el principio te ayudará a comunicarte con confianza. Piensa en el alfabeto como la base de todo lo que aprenderás en español.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo el Alfabeto Español: Una Guía Completa",
          "content": "Paso 1: Familiarízate con las 27 letras del alfabeto. Paso 2: Aprende los sonidos únicos (ñ, ll, rr). Paso 3: Practica la pronunciación de cada letra. Paso 4: Aprende las reglas de acentuación. Paso 5: Practica con palabras comunes. Paso 6: Escucha a hablantes nativos. Paso 7: Repite y practica diariamente. Esta guía te ayuda a dominar el alfabeto español."
        },
        {
          "type": "Guía Visual",
          "title": "El Alfabeto Español",
          "content": "Dibuja el alfabeto: A, B, C, Ch, D, E, F, G, H, I, J, K, L, Ll, M, N, Ñ, O, P, Q, R, Rr, S, T, U, V, W, X, Y, Z. Muestra: Letras únicas, Sonidos especiales, Pronunciación. La guía visual ayuda a entender el alfabeto."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica el Alfabeto",
          "content": "Actividad: Practica el alfabeto español. Pronuncia: Cada letra, Palabras con cada letra, Sonidos únicos. Practica: Pronunciación, Escritura, Reconocimiento. Esta actividad mejora tu conocimiento del alfabeto."
        }
      ],
      "key_points": [
        {
          "title": "El Alfabeto Español 📚",
          "content": "El español tiene 27 letras en el alfabeto. **Letras únicas:** Ñ (eñe), Ch, Ll, Rr. **Cómo entenderlo:** Como el alfabeto inglés pero con letras adicionales. **Mundo real:** Estudiante aprende alfabeto: Aprende 27 letras, Practica sonidos únicos, Pronuncia correctamente, Alfabeto dominado. El alfabeto es la base. **Mejor práctica:** Aprende todas las letras, Practica sonidos únicos, Pronuncia correctamente, Practica el alfabeto."
        },
        {
          "title": "Pronunciación Correcta 🗣️",
          "content": "La pronunciación española es fonética. **Reglas:** Cada letra tiene un sonido, Las vocales son claras, Las consonantes son consistentes. **Cómo entenderlo:** Como pronunciar cada letra claramente. **Mundo real:** Estudiante pronuncia: Pronuncia cada letra, Sigue reglas fonéticas, Habla claramente, Pronunciación correcta. La pronunciación es importante. **Mejor práctica:** Sigue reglas fonéticas, Pronuncia claramente, Escucha a nativos, Practica pronunciación."
        },
        {
          "title": "Letras Especiales ✨",
          "content": "El español tiene letras únicas. **Letras:** Ñ (eñe), Ch, Ll, Rr (doble erre). **Cómo entenderlo:** Como letras especiales del español. **Mundo real:** Estudiante aprende letras especiales: Aprende Ñ, Aprende Ch, Aprende Ll, Aprende Rr, Letras especiales dominadas. Las letras especiales son únicas. **Mejor práctica:** Aprende letras especiales, Practica pronunciación, Usa correctamente, Practica letras especiales."
        },
        {
          "title": "Acentos y Tildes 📝",
          "content": "Los acentos indican énfasis. **Reglas:** Palabras agudas, Palabras graves, Palabras esdrújulas, Acentos diacríticos. **Cómo entenderlo:** Como marcas que indican dónde enfatizar. **Mundo real:** Estudiante aprende acentos: Aprende reglas, Usa tildes correctamente, Pronuncia con énfasis, Acentos dominados. Los acentos son importantes. **Mejor práctica:** Aprende reglas de acentos, Usa tildes correctamente, Pronuncia con énfasis, Practica acentos."
        },
        {
          "title": "Práctica de Pronunciación 🎯",
          "content": "Practicar pronunciación mejora la fluidez. **Técnicas:** Repetir después de nativos, Grabar tu voz, Comparar pronunciación, Practicar diariamente. **Cómo entenderlo:** Como practicar hablar claramente. **Mundo real:** Estudiante practica: Repite después de nativos, Graba su voz, Compara pronunciación, Pronunciación mejorada. La práctica mejora la pronunciación. **Mejor práctica:** Practica diariamente, Escucha a nativos, Graba tu voz, Compara pronunciación, Practica pronunciación."
        }
      ],
      "examples": [
        {
          "scenario": "Aprendiendo el Alfabeto",
          "explanation": "Estudiante aprende alfabeto: Aprende 27 letras, Practica sonidos únicos, Pronuncia correctamente, Alfabeto dominado."
        },
        {
          "scenario": "Pronunciación Correcta",
          "explanation": "Estudiante pronuncia: Pronuncia cada letra, Sigue reglas fonéticas, Habla claramente, Pronunciación correcta."
        },
        {
          "scenario": "Letras Especiales",
          "explanation": "Estudiante aprende letras especiales: Aprende Ñ (niño), Aprende Ch (chico), Aprende Ll (llave), Aprende Rr (perro), Letras especiales dominadas."
        },
        {
          "scenario": "Uso de Acentos",
          "explanation": "Estudiante usa acentos: Aprende reglas, Usa tildes correctamente (más, papá), Pronuncia con énfasis, Acentos dominados."
        }
      ],
      "exercises": [
        {
          "title": "Practica el Alfabeto",
          "instructions": "Paso 1: Memoriza las 27 letras del alfabeto. Paso 2: Practica pronunciar cada letra. Paso 3: Aprende las letras especiales (ñ, ch, ll, rr). Paso 4: Practica con palabras que contengan estas letras. Paso 5: Escucha pronunciaciones de nativos. Paso 6: Repite después de escuchar. Paso 7: Practica diariamente.",
          "example_answer": "Alfabeto practicado: 27 letras memorizadas, Cada letra pronunciada, Letras especiales aprendidas, Palabras practicadas, Escuchado a nativos, Repetido, Practicado diariamente. Alfabeto dominado."
        },
        {
          "title": "Practica la Pronunciación",
          "instructions": "Paso 1: Escucha palabras en español. Paso 2: Repite cada palabra. Paso 3: Graba tu pronunciación. Paso 4: Compara con nativos. Paso 5: Identifica áreas de mejora. Paso 6: Practica sonidos difíciles. Paso 7: Practica diariamente.",
          "example_answer": "Pronunciación practicada: Palabras escuchadas, Repetidas, Grabadas, Comparadas con nativos, Áreas de mejora identificadas, Sonidos difíciles practicados, Practicado diariamente. Pronunciación mejorada."
        },
        {
          "title": "Aprende Acentos",
          "instructions": "Paso 1: Aprende las reglas de acentuación. Paso 2: Identifica palabras agudas, graves y esdrújulas. Paso 3: Practica usando tildes. Paso 4: Aprende acentos diacríticos. Paso 5: Practica con ejemplos. Paso 6: Escribe palabras con acentos. Paso 7: Practica acentos.",
          "example_answer": "Acentos aprendidos: Reglas aprendidas, Palabras identificadas, Tildes usadas, Acentos diacríticos aprendidos, Ejemplos practicados, Palabras escritas, Acentos dominados."
        }
      ],
      "textbooks": [
        {
          "title": "Introducción al Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una introducción completa al alfabeto y pronunciación española."
        },
        {
          "title": "Fonética y Pronunciación del Español",
          "source": "OpenStax",
          "reason": "Cubre el alfabeto español, pronunciación y reglas fonéticas."
        }
      ],
      "videos": [
        {
          "title": "El Alfabeto Español Explicado – Traversy Media",
          "reason": "Explicación simple del alfabeto y pronunciación española."
        },
        {
          "title": "Introducción al Alfabeto Español – freeCodeCamp",
          "reason": "Introducción completa y amigable al alfabeto español."
        }
      ],
      "summary": "El alfabeto español tiene 27 letras con sonidos únicos como la 'ñ', 'ch', 'll' y 'rr'. La pronunciación española es fonética, lo que significa que cada letra tiene un sonido consistente. Los acentos y tildes indican dónde enfatizar las palabras y son esenciales para la pronunciación correcta. Practicar la pronunciación diariamente mejora la fluidez y la confianza al hablar. Dominar el alfabeto y la pronunciación es esencial para aprender español correctamente."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Saludos y Presentaciones",
      "description": "Aprende a saludar y presentarte en español. Los saludos formales e informales son fundamentales para iniciar conversaciones. Saber cómo presentarte y preguntar el nombre de alguien te permite conectarte con hablantes de español desde el primer día. Piensa en los saludos como la puerta de entrada a las conversaciones en español.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Saludos: Una Guía Completa",
          "content": "Paso 1: Aprende saludos formales (Buenos días, Buenas tardes, Buenas noches). Paso 2: Aprende saludos informales (Hola, ¿Qué tal?). Paso 3: Aprende a presentarte (Me llamo, Soy). Paso 4: Aprende a preguntar nombres (¿Cómo te llamas?). Paso 5: Aprende frases de cortesía (Mucho gusto, Encantado). Paso 6: Practica diálogos. Paso 7: Usa saludos en conversaciones. Esta guía te ayuda a dominar los saludos."
        },
        {
          "type": "Guía Visual",
          "title": "Saludos en Español",
          "content": "Dibuja saludos: Formales (Buenos días, Buenas tardes) → Informales (Hola, ¿Qué tal?) → Presentaciones (Me llamo, Soy). Muestra: Saludos formales, Saludos informales, Presentaciones. La guía visual ayuda a entender los saludos."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Saludos",
          "content": "Actividad: Practica saludos en español. Practica: Saludos formales, Saludos informales, Presentaciones, Diálogos. Practica: Conversaciones, Cortesía, Fluidez. Esta actividad mejora tus habilidades de saludo."
        }
      ],
      "key_points": [
        {
          "title": "Saludos Formales 👔",
          "content": "Los saludos formales muestran respeto. **Saludos:** Buenos días (mañana), Buenas tardes (tarde), Buenas noches (noche). **Cómo entenderlo:** Como saludos respetuosos. **Mundo real:** Estudiante usa saludos formales: Dice 'Buenos días' por la mañana, Dice 'Buenas tardes' por la tarde, Muestra respeto, Saludos formales usados. Los saludos formales son importantes. **Mejor práctica:** Usa saludos formales, Aprende cuándo usarlos, Muestra respeto, Practica saludos formales."
        },
        {
          "title": "Saludos Informales 👋",
          "content": "Los saludos informales son casuales. **Saludos:** Hola, ¿Qué tal?, ¿Cómo estás?. **Cómo entenderlo:** Como saludos entre amigos. **Mundo real:** Estudiante usa saludos informales: Dice 'Hola' a amigos, Dice '¿Qué tal?' casualmente, Usa con confianza, Saludos informales usados. Los saludos informales son casuales. **Mejor práctica:** Usa saludos informales, Aprende cuándo usarlos, Usa con confianza, Practica saludos informales."
        },
        {
          "title": "Presentaciones 🤝",
          "content": "Presentarte en español es esencial. **Frases:** Me llamo (Mi nombre es), Soy (Yo soy), ¿Cómo te llamas? (¿Cuál es tu nombre?). **Cómo entenderlo:** Como decir tu nombre y preguntar el nombre de otros. **Mundo real:** Estudiante se presenta: Dice 'Me llamo María', Pregunta '¿Cómo te llamas?', Se presenta correctamente, Presentaciones dominadas. Las presentaciones son esenciales. **Mejor práctica:** Aprende frases de presentación, Practica presentarte, Pregunta nombres, Practica presentaciones."
        },
        {
          "title": "Frases de Cortesía 🙏",
          "content": "Las frases de cortesía muestran buena educación. **Frases:** Mucho gusto (Encantado), Encantado/a, Es un placer. **Cómo entenderlo:** Como mostrar cortesía al conocer a alguien. **Mundo real:** Estudiante usa cortesía: Dice 'Mucho gusto' al conocer, Muestra buena educación, Usa frases apropiadas, Cortesía mostrada. La cortesía es importante. **Mejor práctica:** Aprende frases de cortesía, Úsalas apropiadamente, Muestra buena educación, Practica cortesía."
        },
        {
          "title": "Despedidas 👋",
          "content": "Saber despedirse es tan importante como saludar. **Despedidas:** Adiós, Hasta luego, Hasta pronto, Nos vemos. **Cómo entenderlo:** Como decir adiós apropiadamente. **Mundo real:** Estudiante se despide: Dice 'Adiós' formalmente, Dice 'Hasta luego' casualmente, Se despide apropiadamente, Despedidas dominadas. Las despedidas son importantes. **Mejor práctica:** Aprende despedidas, Úsalas apropiadamente, Practica despedidas, Practica despedidas."
        }
      ],
      "examples": [
        {
          "scenario": "Saludo Formal",
          "explanation": "Estudiante saluda formalmente: Dice 'Buenos días' por la mañana, Muestra respeto, Saludo formal usado."
        },
        {
          "scenario": "Presentación",
          "explanation": "Estudiante se presenta: Dice 'Me llamo Carlos', Pregunta '¿Cómo te llamas?', Se presenta correctamente."
        },
        {
          "scenario": "Cortesía",
          "explanation": "Estudiante muestra cortesía: Dice 'Mucho gusto' al conocer, Muestra buena educación, Cortesía mostrada."
        },
        {
          "scenario": "Despedida",
          "explanation": "Estudiante se despide: Dice 'Hasta luego' casualmente, Se despide apropiadamente, Despedida usada."
        }
      ],
      "exercises": [
        {
          "title": "Practica Saludos",
          "instructions": "Paso 1: Aprende saludos formales e informales. Paso 2: Practica pronunciar cada saludo. Paso 3: Aprende cuándo usar cada saludo. Paso 4: Practica presentarte. Paso 5: Practica preguntar nombres. Paso 6: Crea diálogos de saludo. Paso 7: Practica saludos diariamente.",
          "example_answer": "Saludos practicados: Formales e informales aprendidos, Pronunciados, Uso aprendido, Presentación practicada, Preguntas de nombres practicadas, Diálogos creados, Practicados diariamente. Saludos dominados."
        },
        {
          "title": "Practica Presentaciones",
          "instructions": "Paso 1: Aprende frases de presentación. Paso 2: Practica decir tu nombre. Paso 3: Practica preguntar nombres. Paso 4: Aprende frases de cortesía. Paso 5: Crea diálogos de presentación. Paso 6: Practica con un compañero. Paso 7: Practica presentaciones.",
          "example_answer": "Presentaciones practicadas: Frases aprendidas, Nombre dicho, Preguntas practicadas, Cortesía aprendida, Diálogos creados, Practicado con compañero, Presentaciones dominadas."
        },
        {
          "title": "Practica Despedidas",
          "instructions": "Paso 1: Aprende diferentes despedidas. Paso 2: Aprende cuándo usar cada despedida. Paso 3: Practica pronunciar despedidas. Paso 4: Crea diálogos con despedidas. Paso 5: Practica despedidas formales. Paso 6: Practica despedidas informales. Paso 7: Practica despedidas.",
          "example_answer": "Despedidas practicadas: Diferentes despedidas aprendidas, Uso aprendido, Pronunciadas, Diálogos creados, Formales practicadas, Informales practicadas, Despedidas dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Saludos y Presentaciones en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de saludos y presentaciones en español."
        },
        {
          "title": "Comunicación Básica en Español",
          "source": "OpenStax",
          "reason": "Cubre saludos, presentaciones y frases de cortesía."
        }
      ],
      "videos": [
        {
          "title": "Saludos en Español Tutorial – Traversy Media",
          "reason": "Guía completa de saludos y presentaciones en español."
        },
        {
          "title": "Saludos y Presentaciones – freeCodeCamp",
          "reason": "Tutorial completo sobre saludos y presentaciones en español."
        }
      ],
      "summary": "Los saludos formales (Buenos días, Buenas tardes) muestran respeto y se usan en situaciones formales. Los saludos informales (Hola, ¿Qué tal?) son casuales y se usan con amigos. Presentarte usando 'Me llamo' o 'Soy' y preguntar nombres con '¿Cómo te llamas?' es esencial para las conversaciones. Las frases de cortesía como 'Mucho gusto' y 'Encantado' muestran buena educación. Saber despedirse apropiadamente completa las interacciones sociales. Dominar saludos y presentaciones es fundamental para comunicarte en español desde el primer día."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Números y Fechas",
      "description": "Aprende a contar y hablar sobre fechas en español. Los números son esenciales para contar, hablar de precios, fechas y tiempo. Saber los días de la semana, meses y cómo decir la fecha te permite hablar sobre tiempo y eventos. Piensa en los números como herramientas para expresar cantidad y tiempo en español.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Números y Fechas: Una Guía Completa",
          "content": "Paso 1: Aprende números del 0-30. Paso 2: Aprende números del 31-100. Paso 3: Aprende días de la semana. Paso 4: Aprende meses del año. Paso 5: Aprende a decir la fecha. Paso 6: Aprende a decir la hora. Paso 7: Practica con números y fechas. Esta guía te ayuda a dominar números y fechas."
        },
        {
          "type": "Guía Visual",
          "title": "Números y Fechas en Español",
          "content": "Dibuja números: 0-30 → 31-100 → Días de la semana → Meses → Fechas. Muestra: Números, Días, Meses, Fechas. La guía visual ayuda a entender números y fechas."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Números y Fechas",
          "content": "Actividad: Practica números y fechas en español. Practica: Contar, Decir fechas, Decir la hora, Usar números. Practica: Números, Fechas, Tiempo. Esta actividad mejora tu conocimiento de números y fechas."
        }
      ],
      "key_points": [
        {
          "title": "Números del 0-30 🔢",
          "content": "Los números básicos son fundamentales. **Números:** Cero, Uno, Dos, Tres... Treinta. **Cómo entenderlo:** Como contar desde cero. **Mundo real:** Estudiante aprende números: Aprende 0-30, Practica contar, Usa números, Números básicos dominados. Los números básicos son esenciales. **Mejor práctica:** Aprende 0-30, Practica contar, Usa números, Practica números básicos."
        },
        {
          "title": "Números del 31-100 📊",
          "content": "Los números mayores amplían tu vocabulario. **Números:** Treinta y uno, Cuarenta, Cincuenta... Cien. **Cómo entenderlo:** Como contar números más grandes. **Mundo real:** Estudiante aprende números mayores: Aprende 31-100, Practica contar, Usa números mayores, Números mayores dominados. Los números mayores son útiles. **Mejor práctica:** Aprende 31-100, Practica contar, Usa números mayores, Practica números mayores."
        },
        {
          "title": "Días de la Semana 📅",
          "content": "Los días de la semana son esenciales. **Días:** Lunes, Martes, Miércoles, Jueves, Viernes, Sábado, Domingo. **Cómo entenderlo:** Como los días de la semana. **Mundo real:** Estudiante aprende días: Aprende siete días, Practica días, Usa días, Días dominados. Los días son importantes. **Mejor práctica:** Aprende días, Practica días, Usa días, Practica días de la semana."
        },
        {
          "title": "Meses del Año 🗓️",
          "content": "Los meses te permiten hablar de fechas. **Meses:** Enero, Febrero, Marzo... Diciembre. **Cómo entenderlo:** Como los meses del año. **Mundo real:** Estudiante aprende meses: Aprende doce meses, Practica meses, Usa meses, Meses dominados. Los meses son importantes. **Mejor práctica:** Aprende meses, Practica meses, Usa meses, Practica meses del año."
        },
        {
          "title": "Decir la Fecha 📆",
          "content": "Saber decir la fecha es esencial. **Formato:** El día de mes de año (El 15 de marzo de 2024). **Cómo entenderlo:** Como decir fechas en español. **Mundo real:** Estudiante dice fecha: Dice 'El 15 de marzo', Usa formato correcto, Dice fechas, Fechas dominadas. Decir fechas es importante. **Mejor práctica:** Aprende formato, Practica decir fechas, Usa formato correcto, Practica decir fechas."
        }
      ],
      "examples": [
        {
          "scenario": "Contar Números",
          "explanation": "Estudiante cuenta: Cuenta del 0-30, Cuenta del 31-100, Usa números, Números dominados."
        },
        {
          "scenario": "Días de la Semana",
          "explanation": "Estudiante usa días: Dice 'Lunes', 'Martes', Usa días correctamente, Días dominados."
        },
        {
          "scenario": "Meses del Año",
          "explanation": "Estudiante usa meses: Dice 'Enero', 'Febrero', Usa meses correctamente, Meses dominados."
        },
        {
          "scenario": "Decir la Fecha",
          "explanation": "Estudiante dice fecha: Dice 'El 15 de marzo de 2024', Usa formato correcto, Fecha dicha correctamente."
        }
      ],
      "exercises": [
        {
          "title": "Practica Números",
          "instructions": "Paso 1: Aprende números del 0-30. Paso 2: Aprende números del 31-100. Paso 3: Practica contar. Paso 4: Practica escribir números. Paso 5: Usa números en oraciones. Paso 6: Practica con precios. Paso 7: Practica números diariamente.",
          "example_answer": "Números practicados: 0-30 aprendidos, 31-100 aprendidos, Contar practicado, Escritura practicada, Oraciones con números, Precios practicados, Practicados diariamente. Números dominados."
        },
        {
          "title": "Practica Días y Meses",
          "instructions": "Paso 1: Aprende días de la semana. Paso 2: Aprende meses del año. Paso 3: Practica pronunciar días. Paso 4: Practica pronunciar meses. Paso 5: Usa días en oraciones. Paso 6: Usa meses en oraciones. Paso 7: Practica días y meses.",
          "example_answer": "Días y meses practicados: Días aprendidos, Meses aprendidos, Días pronunciados, Meses pronunciados, Oraciones con días, Oraciones con meses, Días y meses dominados."
        },
        {
          "title": "Practica Decir Fechas",
          "instructions": "Paso 1: Aprende formato de fecha. Paso 2: Practica decir fechas. Paso 3: Escribe fechas. Paso 4: Pregunta fechas. Paso 5: Responde sobre fechas. Paso 6: Practica con fechas importantes. Paso 7: Practica decir fechas.",
          "example_answer": "Fechas practicadas: Formato aprendido, Fechas dichas, Fechas escritas, Preguntas practicadas, Respuestas practicadas, Fechas importantes usadas, Fechas dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Números y Fechas en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de números y fechas en español."
        },
        {
          "title": "Expresiones de Tiempo en Español",
          "source": "OpenStax",
          "reason": "Cubre números, días, meses y fechas en español."
        }
      ],
      "videos": [
        {
          "title": "Números en Español Tutorial – Traversy Media",
          "reason": "Guía completa de números en español."
        },
        {
          "title": "Fechas y Tiempo en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre fechas y tiempo en español."
        }
      ],
      "summary": "Los números del 0-100 son esenciales para contar, hablar de precios y expresar cantidad. Los días de la semana (Lunes a Domingo) te permiten hablar sobre tiempo y eventos. Los meses del año (Enero a Diciembre) son necesarios para decir fechas. El formato de fecha en español es 'El día de mes de año' (El 15 de marzo de 2024). Saber números y fechas te permite comunicarte sobre tiempo, eventos y cantidades. Dominar números y fechas es fundamental para hablar sobre tiempo y cantidad en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Artículos y Sustantivos",
      "description": "Aprende los artículos (el, la, los, las) y los sustantivos en español. Los artículos indican el género (masculino/femenino) y número (singular/plural) de los sustantivos. Entender los artículos y sustantivos es esencial para construir oraciones correctas. Piensa en los artículos como palabras que acompañan a los sustantivos para indicar su género y número.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Artículos y Sustantivos: Una Guía Completa",
          "content": "Paso 1: Aprende artículos definidos (el, la, los, las). Paso 2: Aprende artículos indefinidos (un, una, unos, unas). Paso 3: Aprende género de sustantivos (masculino/femenino). Paso 4: Aprende plural de sustantivos. Paso 5: Practica concordancia (artículo + sustantivo). Paso 6: Aprende excepciones. Paso 7: Practica con oraciones. Esta guía te ayuda a dominar artículos y sustantivos."
        },
        {
          "type": "Guía Visual",
          "title": "Artículos y Sustantivos",
          "content": "Dibuja artículos: El/La (singular) → Los/Las (plural). Muestra: Artículos definidos, Artículos indefinidos, Género, Número. La guía visual ayuda a entender artículos y sustantivos."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Artículos y Sustantivos",
          "content": "Actividad: Practica artículos y sustantivos en español. Practica: Artículos definidos, Artículos indefinidos, Género, Plural. Practica: Concordancia, Oraciones. Esta actividad mejora tu conocimiento de artículos y sustantivos."
        }
      ],
      "key_points": [
        {
          "title": "Artículos Definidos 📝",
          "content": "Los artículos definidos indican algo específico. **Artículos:** El (masculino singular), La (femenino singular), Los (masculino plural), Las (femenino plural). **Cómo entenderlo:** Como 'the' en inglés. **Mundo real:** Estudiante usa artículos: Dice 'el libro', Dice 'la mesa', Usa artículos correctamente, Artículos definidos dominados. Los artículos definidos son importantes. **Mejor práctica:** Aprende artículos, Usa correctamente, Practica concordancia, Practica artículos definidos."
        },
        {
          "title": "Artículos Indefinidos 📄",
          "content": "Los artículos indefinidos indican algo no específico. **Artículos:** Un (masculino singular), Una (femenino singular), Unos (masculino plural), Unas (femenino plural). **Cómo entenderlo:** Como 'a/an' en inglés. **Mundo real:** Estudiante usa artículos indefinidos: Dice 'un libro', Dice 'una mesa', Usa artículos correctamente, Artículos indefinidos dominados. Los artículos indefinidos son importantes. **Mejor práctica:** Aprende artículos indefinidos, Usa correctamente, Practica concordancia, Practica artículos indefinidos."
        },
        {
          "title": "Género de Sustantivos ⚥",
          "content": "Los sustantivos tienen género (masculino/femenino). **Reglas:** Sustantivos que terminan en -o son masculinos, Sustantivos que terminan en -a son femeninos, Hay excepciones. **Cómo entenderlo:** Como género de palabras. **Mundo real:** Estudiante aprende género: Aprende reglas, Identifica género, Usa género correctamente, Género dominado. El género es importante. **Mejor práctica:** Aprende reglas de género, Identifica género, Usa correctamente, Practica género."
        },
        {
          "title": "Plural de Sustantivos 📚",
          "content": "Los sustantivos tienen número (singular/plural). **Reglas:** Agregar -s a palabras que terminan en vocal, Agregar -es a palabras que terminan en consonante, Hay excepciones. **Cómo entenderlo:** Como hacer palabras plurales. **Mundo real:** Estudiante aprende plural: Aprende reglas, Forma plurales, Usa plurales correctamente, Plural dominado. El plural es importante. **Mejor práctica:** Aprende reglas de plural, Forma plurales, Usa correctamente, Practica plural."
        },
        {
          "title": "Concordancia 🎯",
          "content": "El artículo debe concordar con el sustantivo. **Reglas:** Artículo y sustantivo deben tener mismo género, Artículo y sustantivo deben tener mismo número. **Cómo entenderlo:** Como hacer que artículo y sustantivo coincidan. **Mundo real:** Estudiante usa concordancia: Usa 'el libro' (masculino singular), Usa 'las mesas' (femenino plural), Concordancia correcta, Concordancia dominada. La concordancia es esencial. **Mejor práctica:** Aprende concordancia, Practica concordancia, Usa correctamente, Practica concordancia."
        }
      ],
      "examples": [
        {
          "scenario": "Artículos Definidos",
          "explanation": "Estudiante usa artículos: Dice 'el libro' (masculino singular), Dice 'la mesa' (femenino singular), Usa artículos correctamente."
        },
        {
          "scenario": "Artículos Indefinidos",
          "explanation": "Estudiante usa artículos indefinidos: Dice 'un libro', Dice 'una mesa', Usa artículos correctamente."
        },
        {
          "scenario": "Género",
          "explanation": "Estudiante identifica género: Identifica 'libro' como masculino, Identifica 'mesa' como femenino, Género identificado correctamente."
        },
        {
          "scenario": "Concordancia",
          "explanation": "Estudiante usa concordancia: Usa 'el libro' (masculino singular), Usa 'las mesas' (femenino plural), Concordancia correcta."
        }
      ],
      "exercises": [
        {
          "title": "Practica Artículos Definidos",
          "instructions": "Paso 1: Aprende artículos definidos (el, la, los, las). Paso 2: Aprende cuándo usar cada artículo. Paso 3: Practica con sustantivos masculinos. Paso 4: Practica con sustantivos femeninos. Paso 5: Practica con plurales. Paso 6: Crea oraciones con artículos. Paso 7: Practica artículos definidos.",
          "example_answer": "Artículos definidos practicados: Artículos aprendidos, Uso aprendido, Masculinos practicados, Femeninos practicados, Plurales practicados, Oraciones creadas, Artículos definidos dominados."
        },
        {
          "title": "Practica Género y Plural",
          "instructions": "Paso 1: Aprende reglas de género. Paso 2: Aprende reglas de plural. Paso 3: Identifica género de sustantivos. Paso 4: Forma plurales. Paso 5: Practica con excepciones. Paso 6: Usa género y plural en oraciones. Paso 7: Practica género y plural.",
          "example_answer": "Género y plural practicados: Reglas de género aprendidas, Reglas de plural aprendidas, Género identificado, Plurales formados, Excepciones practicadas, Oraciones con género y plural, Género y plural dominados."
        },
        {
          "title": "Practica Concordancia",
          "instructions": "Paso 1: Aprende reglas de concordancia. Paso 2: Practica concordancia con artículos definidos. Paso 3: Practica concordancia con artículos indefinidos. Paso 4: Crea oraciones con concordancia correcta. Paso 5: Identifica errores de concordancia. Paso 6: Corrige errores. Paso 7: Practica concordancia.",
          "example_answer": "Concordancia practicada: Reglas aprendidas, Concordancia con definidos practicada, Concordancia con indefinidos practicada, Oraciones creadas, Errores identificados, Errores corregidos, Concordancia dominada."
        }
      ],
      "textbooks": [
        {
          "title": "Gramática Española: Artículos y Sustantivos",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de artículos y sustantivos en español."
        },
        {
          "title": "Fundamentos de Gramática Española",
          "source": "OpenStax",
          "reason": "Cubre artículos, sustantivos, género y número en español."
        }
      ],
      "videos": [
        {
          "title": "Artículos en Español Tutorial – Traversy Media",
          "reason": "Guía completa de artículos y sustantivos en español."
        },
        {
          "title": "Gramática Básica en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre artículos y sustantivos."
        }
      ],
      "summary": "Los artículos definidos (el, la, los, las) indican algo específico y deben concordar con el sustantivo en género y número. Los artículos indefinidos (un, una, unos, unas) indican algo no específico. Los sustantivos tienen género (masculino/femenino) y número (singular/plural). La concordancia entre artículo y sustantivo es esencial para oraciones correctas. Aprender las reglas de género y plural te permite usar artículos y sustantivos correctamente. Dominar artículos y sustantivos es fundamental para construir oraciones correctas en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Verbos en Presente (Regular)",
      "description": "Aprende a conjugar verbos regulares en presente. Los verbos regulares siguen patrones consistentes según su terminación (-ar, -er, -ir). Dominar la conjugación en presente te permite hablar sobre acciones actuales y hábitos. Piensa en los verbos regulares como verbos que siguen reglas predecibles para cada persona.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Verbos Regulares: Una Guía Completa",
          "content": "Paso 1: Aprende verbos -ar (hablar, cantar). Paso 2: Aprende verbos -er (comer, beber). Paso 3: Aprende verbos -ir (vivir, escribir). Paso 4: Aprende conjugaciones (yo, tú, él/ella, nosotros, vosotros, ellos/ellas). Paso 5: Practica conjugaciones. Paso 6: Usa verbos en oraciones. Paso 7: Practica verbos regulares. Esta guía te ayuda a dominar verbos regulares."
        },
        {
          "type": "Guía Visual",
          "title": "Conjugación de Verbos Regulares",
          "content": "Dibuja conjugación: Verbos -ar → Verbos -er → Verbos -ir. Muestra: Terminaciones, Conjugaciones, Patrones. La guía visual ayuda a entender la conjugación."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Verbos Regulares",
          "content": "Actividad: Practica verbos regulares en español. Practica: Verbos -ar, Verbos -er, Verbos -ir, Conjugaciones. Practica: Oraciones, Fluidez. Esta actividad mejora tu conocimiento de verbos regulares."
        }
      ],
      "key_points": [
        {
          "title": "Verbos -AR 📝",
          "content": "Los verbos -ar son los más comunes. **Ejemplos:** Hablar, Cantar, Bailar, Estudiar. **Conjugación:** Yo hablo, Tú hablas, Él/Ella habla, Nosotros hablamos, Vosotros habláis, Ellos/Ellas hablan. **Cómo entenderlo:** Como verbos que terminan en -ar. **Mundo real:** Estudiante conjuga verbos -ar: Conjuga 'hablar', Usa todas las personas, Verbos -ar dominados. Los verbos -ar son comunes. **Mejor práctica:** Aprende verbos -ar, Practica conjugación, Usa en oraciones, Practica verbos -ar."
        },
        {
          "title": "Verbos -ER 📄",
          "content": "Los verbos -er siguen un patrón similar. **Ejemplos:** Comer, Beber, Leer, Aprender. **Conjugación:** Yo como, Tú comes, Él/Ella come, Nosotros comemos, Vosotros coméis, Ellos/Ellas comen. **Cómo entenderlo:** Como verbos que terminan en -er. **Mundo real:** Estudiante conjuga verbos -er: Conjuga 'comer', Usa todas las personas, Verbos -er dominados. Los verbos -er son importantes. **Mejor práctica:** Aprende verbos -er, Practica conjugación, Usa en oraciones, Practica verbos -er."
        },
        {
          "title": "Verbos -IR 📚",
          "content": "Los verbos -ir completan los verbos regulares. **Ejemplos:** Vivir, Escribir, Abrir, Compartir. **Conjugación:** Yo vivo, Tú vives, Él/Ella vive, Nosotros vivimos, Vosotros vivís, Ellos/Ellas viven. **Cómo entenderlo:** Como verbos que terminan en -ir. **Mundo real:** Estudiante conjuga verbos -ir: Conjuga 'vivir', Usa todas las personas, Verbos -ir dominados. Los verbos -ir son importantes. **Mejor práctica:** Aprende verbos -ir, Practica conjugación, Usa en oraciones, Practica verbos -ir."
        },
        {
          "title": "Patrones de Conjugación 🎯",
          "content": "Cada tipo de verbo tiene un patrón. **Patrones:** -ar: -o, -as, -a, -amos, -áis, -an. -er: -o, -es, -e, -emos, -éis, -en. -ir: -o, -es, -e, -imos, -ís, -en. **Cómo entenderlo:** Como patrones predecibles. **Mundo real:** Estudiante aprende patrones: Aprende patrones -ar, Aprende patrones -er, Aprende patrones -ir, Patrones dominados. Los patrones son útiles. **Mejor práctica:** Aprende patrones, Memoriza terminaciones, Practica patrones, Practica patrones de conjugación."
        },
        {
          "title": "Uso del Presente ⏰",
          "content": "El presente se usa para acciones actuales. **Usos:** Acciones actuales, Hábitos, Verdades generales. **Cómo entenderlo:** Como hablar sobre el ahora. **Mundo real:** Estudiante usa presente: Habla de acciones actuales, Describe hábitos, Expresa verdades, Presente usado correctamente. El presente es esencial. **Mejor práctica:** Aprende usos del presente, Practica con acciones actuales, Describe hábitos, Practica uso del presente."
        }
      ],
      "examples": [
        {
          "scenario": "Verbos -AR",
          "explanation": "Estudiante conjuga verbos -ar: Conjuga 'hablar' (yo hablo, tú hablas), Usa todas las personas, Verbos -ar dominados."
        },
        {
          "scenario": "Verbos -ER",
          "explanation": "Estudiante conjuga verbos -er: Conjuga 'comer' (yo como, tú comes), Usa todas las personas, Verbos -er dominados."
        },
        {
          "scenario": "Verbos -IR",
          "explanation": "Estudiante conjuga verbos -ir: Conjuga 'vivir' (yo vivo, tú vives), Usa todas las personas, Verbos -ir dominados."
        },
        {
          "scenario": "Uso del Presente",
          "explanation": "Estudiante usa presente: Dice 'Yo estudio español', Describe hábito, Presente usado correctamente."
        }
      ],
      "exercises": [
        {
          "title": "Practica Verbos -AR",
          "instructions": "Paso 1: Aprende verbos -ar comunes. Paso 2: Aprende conjugación -ar. Paso 3: Practica conjugar verbos -ar. Paso 4: Usa verbos -ar en oraciones. Paso 5: Practica con diferentes verbos. Paso 6: Crea oraciones con verbos -ar. Paso 7: Practica verbos -ar.",
          "example_answer": "Verbos -ar practicados: Verbos comunes aprendidos, Conjugación aprendida, Verbos conjugados, Oraciones con verbos -ar, Diferentes verbos practicados, Oraciones creadas, Verbos -ar dominados."
        },
        {
          "title": "Practica Verbos -ER e -IR",
          "instructions": "Paso 1: Aprende verbos -er comunes. Paso 2: Aprende verbos -ir comunes. Paso 3: Practica conjugación -er. Paso 4: Practica conjugación -ir. Paso 5: Usa verbos en oraciones. Paso 6: Compara verbos -er e -ir. Paso 7: Practica verbos -er e -ir.",
          "example_answer": "Verbos -er e -ir practicados: Verbos -er aprendidos, Verbos -ir aprendidos, Conjugación -er practicada, Conjugación -ir practicada, Oraciones con verbos, Verbos comparados, Verbos -er e -ir dominados."
        },
        {
          "title": "Practica Uso del Presente",
          "instructions": "Paso 1: Aprende usos del presente. Paso 2: Practica con acciones actuales. Paso 3: Practica con hábitos. Paso 4: Practica con verdades generales. Paso 5: Crea oraciones usando presente. Paso 6: Identifica usos del presente. Paso 7: Practica uso del presente.",
          "example_answer": "Uso del presente practicado: Usos aprendidos, Acciones actuales practicadas, Hábitos practicados, Verdades generales practicadas, Oraciones creadas, Usos identificados, Uso del presente dominado."
        }
      ],
      "textbooks": [
        {
          "title": "Verbos Regulares en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de verbos regulares en presente."
        },
        {
          "title": "Conjugación de Verbos en Español",
          "source": "OpenStax",
          "reason": "Cubre verbos regulares, conjugación y uso del presente."
        }
      ],
      "videos": [
        {
          "title": "Verbos Regulares Tutorial – Traversy Media",
          "reason": "Guía completa de verbos regulares en español."
        },
        {
          "title": "Conjugación en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre verbos regulares y conjugación."
        }
      ],
      "summary": "Los verbos regulares en español siguen patrones predecibles según su terminación (-ar, -er, -ir). Los verbos -ar son los más comunes y siguen el patrón: -o, -as, -a, -amos, -áis, -an. Los verbos -er siguen: -o, -es, -e, -emos, -éis, -en. Los verbos -ir siguen: -o, -es, -e, -imos, -ís, -en. El presente se usa para acciones actuales, hábitos y verdades generales. Dominar los verbos regulares en presente es fundamental para expresar acciones y hábitos en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Verbos Irregulares Comunes",
      "description": "Aprende los verbos irregulares más comunes en presente. Verbos como ser, estar, tener, ir, hacer y venir son esenciales y se usan frecuentemente. Estos verbos no siguen los patrones regulares y deben memorizarse. Piensa en los verbos irregulares como verbos especiales que necesitas aprender individualmente.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Verbos Irregulares: Una Guía Completa",
          "content": "Paso 1: Aprende ser (soy, eres, es, somos, sois, son). Paso 2: Aprende estar (estoy, estás, está, estamos, estáis, están). Paso 3: Aprende tener (tengo, tienes, tiene, tenemos, tenéis, tienen). Paso 4: Aprende ir (voy, vas, va, vamos, vais, van). Paso 5: Aprende hacer (hago, haces, hace, hacemos, hacéis, hacen). Paso 6: Aprende venir (vengo, vienes, viene, venimos, venís, vienen). Paso 7: Practica verbos irregulares. Esta guía te ayuda a dominar verbos irregulares."
        },
        {
          "type": "Guía Visual",
          "title": "Verbos Irregulares Comunes",
          "content": "Dibuja verbos: Ser → Estar → Tener → Ir → Hacer → Venir. Muestra: Conjugaciones, Usos, Diferencias. La guía visual ayuda a entender verbos irregulares."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Verbos Irregulares",
          "content": "Actividad: Practica verbos irregulares en español. Practica: Ser, Estar, Tener, Ir, Hacer, Venir. Practica: Conjugaciones, Oraciones, Diferencias. Esta actividad mejora tu conocimiento de verbos irregulares."
        }
      ],
      "key_points": [
        {
          "title": "Ser vs Estar 🔄",
          "content": "Ser y estar son verbos esenciales pero diferentes. **Ser:** Identidad, Características permanentes, Origen, Profesión. **Estar:** Ubicación, Estado temporal, Condiciones. **Cómo entenderlo:** Como 'to be' pero con dos formas. **Mundo real:** Estudiante usa ser/estar: Usa 'ser' para identidad (Yo soy estudiante), Usa 'estar' para ubicación (Estoy en casa), Diferencia entendida, Ser/estar dominados. Ser y estar son diferentes. **Mejor práctica:** Aprende diferencias, Usa ser para permanente, Usa estar para temporal, Practica ser vs estar."
        },
        {
          "title": "Tener (Tener) 💰",
          "content": "Tener significa 'to have' pero también se usa en expresiones. **Conjugación:** Tengo, Tienes, Tiene, Tenemos, Tenéis, Tienen. **Usos:** Posesión, Edad (tener años), Expresiones (tener hambre, tener sed). **Cómo entenderlo:** Como tener algo o tener una condición. **Mundo real:** Estudiante usa tener: Dice 'Tengo un libro', Dice 'Tengo 20 años', Dice 'Tengo hambre', Tener usado correctamente. Tener es muy útil. **Mejor práctica:** Aprende conjugación, Usa para posesión, Usa en expresiones, Practica tener."
        },
        {
          "title": "Ir (To Go) 🚶",
          "content": "Ir significa 'to go' y es muy común. **Conjugación:** Voy, Vas, Va, Vamos, Vais, Van. **Usos:** Movimiento, Futuro próximo (ir a + infinitivo). **Cómo entenderlo:** Como ir a algún lugar. **Mundo real:** Estudiante usa ir: Dice 'Voy a la escuela', Dice 'Voy a estudiar', Usa ir correctamente, Ir dominado. Ir es esencial. **Mejor práctica:** Aprende conjugación, Usa para movimiento, Usa para futuro próximo, Practica ir."
        },
        {
          "title": "Hacer (To Do/Make) 🛠️",
          "content": "Hacer significa 'to do' o 'to make'. **Conjugación:** Hago, Haces, Hace, Hacemos, Hacéis, Hacen. **Usos:** Acciones, Tiempo (hace tiempo), Expresiones. **Cómo entenderlo:** Como hacer algo. **Mundo real:** Estudiante usa hacer: Dice 'Hago mi tarea', Dice 'Hace dos días', Usa hacer correctamente, Hacer dominado. Hacer es común. **Mejor práctica:** Aprende conjugación, Usa para acciones, Usa para tiempo, Practica hacer."
        },
        {
          "title": "Venir (To Come) 🏃",
          "content": "Venir significa 'to come'. **Conjugación:** Vengo, Vienes, Viene, Venimos, Venís, Vienen. **Usos:** Movimiento hacia el hablante, Expresiones. **Cómo entenderlo:** Como venir hacia aquí. **Mundo real:** Estudiante usa venir: Dice 'Vengo de España', Dice 'Vienes aquí', Usa venir correctamente, Venir dominado. Venir es útil. **Mejor práctica:** Aprende conjugación, Usa para movimiento, Practica venir, Practica venir."
        }
      ],
      "examples": [
        {
          "scenario": "Ser vs Estar",
          "explanation": "Estudiante diferencia ser/estar: Usa 'ser' para identidad (Soy estudiante), Usa 'estar' para ubicación (Estoy en casa), Diferencia entendida."
        },
        {
          "scenario": "Tener",
          "explanation": "Estudiante usa tener: Dice 'Tengo un libro', Dice 'Tengo hambre', Tener usado correctamente."
        },
        {
          "scenario": "Ir",
          "explanation": "Estudiante usa ir: Dice 'Voy a la escuela', Dice 'Voy a estudiar', Ir usado correctamente."
        },
        {
          "scenario": "Hacer",
          "explanation": "Estudiante usa hacer: Dice 'Hago mi tarea', Dice 'Hace dos días', Hacer usado correctamente."
        }
      ],
      "exercises": [
        {
          "title": "Practica Ser y Estar",
          "instructions": "Paso 1: Aprende diferencias entre ser y estar. Paso 2: Aprende conjugación de ser. Paso 3: Aprende conjugación de estar. Paso 4: Practica usar ser. Paso 5: Practica usar estar. Paso 6: Crea oraciones con ser y estar. Paso 7: Practica ser y estar.",
          "example_answer": "Ser y estar practicados: Diferencias aprendidas, Conjugación de ser aprendida, Conjugación de estar aprendida, Ser usado, Estar usado, Oraciones creadas, Ser y estar dominados."
        },
        {
          "title": "Practica Tener, Ir y Hacer",
          "instructions": "Paso 1: Aprende conjugación de tener. Paso 2: Aprende conjugación de ir. Paso 3: Aprende conjugación de hacer. Paso 4: Practica usar tener. Paso 5: Practica usar ir. Paso 6: Practica usar hacer. Paso 7: Practica tener, ir y hacer.",
          "example_answer": "Tener, ir y hacer practicados: Conjugación de tener aprendida, Conjugación de ir aprendida, Conjugación de hacer aprendida, Tener usado, Ir usado, Hacer usado, Tener, ir y hacer dominados."
        },
        {
          "title": "Practica Todos los Irregulares",
          "instructions": "Paso 1: Repasa todos los verbos irregulares. Paso 2: Practica conjugaciones. Paso 3: Usa en oraciones. Paso 4: Identifica usos correctos. Paso 5: Crea diálogos. Paso 6: Practica con expresiones. Paso 7: Practica verbos irregulares.",
          "example_answer": "Verbos irregulares practicados: Todos repasados, Conjugaciones practicadas, Oraciones creadas, Usos identificados, Diálogos creados, Expresiones practicadas, Verbos irregulares dominados."
        }
      ],
      "textbooks": [
        {
          "title": "Verbos Irregulares en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de verbos irregulares en español."
        },
        {
          "title": "Ser, Estar y Otros Verbos Irregulares",
          "source": "OpenStax",
          "reason": "Cubre verbos irregulares comunes y sus usos."
        }
      ],
      "videos": [
        {
          "title": "Verbos Irregulares Tutorial – Traversy Media",
          "reason": "Guía completa de verbos irregulares en español."
        },
        {
          "title": "Ser vs Estar en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre ser, estar y verbos irregulares."
        }
      ],
      "summary": "Los verbos irregulares comunes (ser, estar, tener, ir, hacer, venir) son esenciales en español. Ser y estar ambos significan 'to be' pero se usan para diferentes propósitos: ser para identidad y características permanentes, estar para ubicación y estados temporales. Tener significa 'to have' y se usa para posesión, edad y expresiones. Ir significa 'to go' y se usa para movimiento y futuro próximo. Hacer significa 'to do/make' y es muy común. Venir significa 'to come'. Estos verbos deben memorizarse ya que no siguen patrones regulares. Dominar verbos irregulares comunes es fundamental para comunicarte efectivamente en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Adjetivos y Descripciones",
      "description": "Aprende a usar adjetivos para describir personas, lugares y cosas en español. Los adjetivos deben concordar con los sustantivos en género y número. Saber usar adjetivos te permite describir el mundo que te rodea. Piensa en los adjetivos como palabras que añaden detalles y color a tus descripciones.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Adjetivos: Una Guía Completa",
          "content": "Paso 1: Aprende adjetivos comunes (grande, pequeño, bonito, feo). Paso 2: Aprende concordancia de género. Paso 3: Aprende concordancia de número. Paso 4: Aprende posición de adjetivos. Paso 5: Practica con adjetivos descriptivos. Paso 6: Usa adjetivos en oraciones. Paso 7: Practica adjetivos. Esta guía te ayuda a dominar adjetivos."
        },
        {
          "type": "Guía Visual",
          "title": "Adjetivos en Español",
          "content": "Dibuja adjetivos: Grande/Pequeño → Bonito/Feo → Alto/Bajo. Muestra: Concordancia, Posición, Género. La guía visual ayuda a entender adjetivos."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Adjetivos",
          "content": "Actividad: Practica adjetivos en español. Practica: Adjetivos comunes, Concordancia, Posición, Descripciones. Practica: Oraciones, Fluidez. Esta actividad mejora tu conocimiento de adjetivos."
        }
      ],
      "key_points": [
        {
          "title": "Adjetivos Comunes 📝",
          "content": "Los adjetivos comunes son esenciales. **Adjetivos:** Grande (big), Pequeño (small), Bonito (pretty), Feo (ugly), Alto (tall), Bajo (short). **Cómo entenderlo:** Como palabras descriptivas. **Mundo real:** Estudiante usa adjetivos: Dice 'casa grande', Dice 'libro pequeño', Usa adjetivos, Adjetivos usados. Los adjetivos son importantes. **Mejor práctica:** Aprende adjetivos comunes, Usa en descripciones, Practica adjetivos, Practica adjetivos comunes."
        },
        {
          "title": "Concordancia de Género ⚥",
          "content": "Los adjetivos deben concordar en género. **Reglas:** Adjetivos que terminan en -o son masculinos, Adjetivos que terminan en -a son femeninos, Adjetivos que terminan en -e no cambian. **Cómo entenderlo:** Como hacer que adjetivo y sustantivo coincidan. **Mundo real:** Estudiante usa concordancia: Usa 'libro grande' (masculino), Usa 'mesa grande' (femenino), Concordancia correcta, Concordancia dominada. La concordancia es esencial. **Mejor práctica:** Aprende reglas de género, Practica concordancia, Usa correctamente, Practica concordancia de género."
        },
        {
          "title": "Concordancia de Número 📊",
          "content": "Los adjetivos deben concordar en número. **Reglas:** Agregar -s para plural, Adjetivos que terminan en vocal agregan -s, Adjetivos que terminan en consonante agregan -es. **Cómo entenderlo:** Como hacer adjetivos plurales. **Mundo real:** Estudiante usa concordancia: Usa 'libros grandes' (plural), Concordancia correcta, Concordancia dominada. La concordancia de número es importante. **Mejor práctica:** Aprende reglas de plural, Practica concordancia, Usa correctamente, Practica concordancia de número."
        },
        {
          "title": "Posición de Adjetivos 📍",
          "content": "Los adjetivos pueden ir antes o después del sustantivo. **Reglas:** La mayoría va después del sustantivo, Algunos van antes (bueno, malo, grande, pequeño), El significado puede cambiar. **Cómo entenderlo:** Como dónde colocar el adjetivo. **Mundo real:** Estudiante coloca adjetivos: Coloca 'casa grande', Coloca 'buen libro', Posición correcta, Posición dominada. La posición es importante. **Mejor práctica:** Aprende reglas de posición, Practica posición, Usa correctamente, Practica posición de adjetivos."
        },
        {
          "title": "Adjetivos Posesivos 💼",
          "content": "Los adjetivos posesivos indican posesión. **Adjetivos:** Mi (my), Tu (your), Su (his/her/your), Nuestro (our), Vuestro (your plural), Su (their/your). **Cómo entenderlo:** Como indicar que algo es tuyo. **Mundo real:** Estudiante usa posesivos: Dice 'mi libro', Dice 'tu casa', Usa posesivos correctamente, Posesivos dominados. Los posesivos son útiles. **Mejor práctica:** Aprende posesivos, Usa correctamente, Practica posesivos, Practica adjetivos posesivos."
        }
      ],
      "examples": [
        {
          "scenario": "Adjetivos Comunes",
          "explanation": "Estudiante usa adjetivos: Dice 'casa grande', Dice 'libro pequeño', Adjetivos usados correctamente."
        },
        {
          "scenario": "Concordancia",
          "explanation": "Estudiante usa concordancia: Usa 'libro grande' (masculino), Usa 'mesa grande' (femenino), Concordancia correcta."
        },
        {
          "scenario": "Posición",
          "explanation": "Estudiante coloca adjetivos: Coloca 'casa grande' (después), Coloca 'buen libro' (antes), Posición correcta."
        },
        {
          "scenario": "Posesivos",
          "explanation": "Estudiante usa posesivos: Dice 'mi libro', Dice 'tu casa', Posesivos usados correctamente."
        }
      ],
      "exercises": [
        {
          "title": "Practica Adjetivos Comunes",
          "instructions": "Paso 1: Aprende adjetivos comunes. Paso 2: Practica pronunciar adjetivos. Paso 3: Aprende concordancia de género. Paso 4: Aprende concordancia de número. Paso 5: Usa adjetivos en oraciones. Paso 6: Crea descripciones. Paso 7: Practica adjetivos comunes.",
          "example_answer": "Adjetivos comunes practicados: Adjetivos aprendidos, Pronunciados, Concordancia de género aprendida, Concordancia de número aprendida, Oraciones creadas, Descripciones creadas, Adjetivos comunes dominados."
        },
        {
          "title": "Practica Concordancia",
          "instructions": "Paso 1: Aprende reglas de concordancia. Paso 2: Practica concordancia de género. Paso 3: Practica concordancia de número. Paso 4: Crea oraciones con concordancia correcta. Paso 5: Identifica errores de concordancia. Paso 6: Corrige errores. Paso 7: Practica concordancia.",
          "example_answer": "Concordancia practicada: Reglas aprendidas, Concordancia de género practicada, Concordancia de número practicada, Oraciones creadas, Errores identificados, Errores corregidos, Concordancia dominada."
        },
        {
          "title": "Practica Posesivos",
          "instructions": "Paso 1: Aprende adjetivos posesivos. Paso 2: Practica usar posesivos. Paso 3: Usa posesivos en oraciones. Paso 4: Practica con diferentes personas. Paso 5: Crea diálogos con posesivos. Paso 6: Practica posesivos. Paso 7: Practica adjetivos posesivos.",
          "example_answer": "Posesivos practicados: Posesivos aprendidos, Usados, Oraciones con posesivos, Diferentes personas practicadas, Diálogos creados, Posesivos dominados."
        }
      ],
      "textbooks": [
        {
          "title": "Adjetivos en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de adjetivos y descripciones en español."
        },
        {
          "title": "Gramática Española: Adjetivos",
          "source": "OpenStax",
          "reason": "Cubre adjetivos, concordancia y posición en español."
        }
      ],
      "videos": [
        {
          "title": "Adjetivos en Español Tutorial – Traversy Media",
          "reason": "Guía completa de adjetivos en español."
        },
        {
          "title": "Descripciones en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre adjetivos y descripciones."
        }
      ],
      "summary": "Los adjetivos describen personas, lugares y cosas en español. Los adjetivos deben concordar con los sustantivos en género (masculino/femenino) y número (singular/plural). La mayoría de los adjetivos van después del sustantivo, aunque algunos comunes (bueno, malo, grande, pequeño) pueden ir antes. Los adjetivos posesivos (mi, tu, su, nuestro) indican posesión y también deben concordar. Aprender a usar adjetivos correctamente te permite hacer descripciones detalladas. Dominar adjetivos y descripciones es fundamental para describir el mundo que te rodea en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Vocabulario de Comida y Restaurantes",
      "description": "Aprende vocabulario relacionado con comida, bebidas y restaurantes en español. Saber hablar sobre comida te permite ordenar en restaurantes, comprar en mercados y tener conversaciones sobre comida. Piensa en el vocabulario de comida como herramientas esenciales para situaciones cotidianas.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Vocabulario de Comida: Una Guía Completa",
          "content": "Paso 1: Aprende frutas (manzana, plátano, naranja). Paso 2: Aprende verduras (tomate, lechuga, zanahoria). Paso 3: Aprende carnes (pollo, pescado, carne). Paso 4: Aprende bebidas (agua, café, leche). Paso 5: Aprende frases de restaurante. Paso 6: Practica ordenar comida. Paso 7: Practica vocabulario de comida. Esta guía te ayuda a dominar vocabulario de comida."
        },
        {
          "type": "Guía Visual",
          "title": "Comida en Español",
          "content": "Dibuja comida: Frutas → Verduras → Carnes → Bebidas. Muestra: Vocabulario, Frases, Restaurantes. La guía visual ayuda a entender vocabulario de comida."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Vocabulario de Comida",
          "content": "Actividad: Practica vocabulario de comida en español. Practica: Frutas, Verduras, Carnes, Bebidas, Restaurantes. Practica: Ordenar, Conversaciones. Esta actividad mejora tu vocabulario de comida."
        }
      ],
      "key_points": [
        {
          "title": "Frutas 🍎",
          "content": "Las frutas son parte esencial de la dieta. **Frutas:** Manzana (apple), Plátano (banana), Naranja (orange), Fresa (strawberry), Uva (grape). **Cómo entenderlo:** Como nombres de frutas. **Mundo real:** Estudiante usa frutas: Dice 'Quiero una manzana', Ordena frutas, Vocabulario de frutas usado. Las frutas son importantes. **Mejor práctica:** Aprende nombres de frutas, Usa en oraciones, Practica frutas, Practica vocabulario de frutas."
        },
        {
          "title": "Verduras 🥕",
          "content": "Las verduras son saludables. **Verduras:** Tomate (tomato), Lechuga (lettuce), Zanahoria (carrot), Cebolla (onion), Patata (potato). **Cómo entenderlo:** Como nombres de verduras. **Mundo real:** Estudiante usa verduras: Dice 'Quiero tomates', Ordena verduras, Vocabulario de verduras usado. Las verduras son importantes. **Mejor práctica:** Aprende nombres de verduras, Usa en oraciones, Practica verduras, Practica vocabulario de verduras."
        },
        {
          "title": "Carnes y Proteínas 🍗",
          "content": "Las carnes son fuente de proteína. **Carnes:** Pollo (chicken), Pescado (fish), Carne (beef), Cerdo (pork), Huevo (egg). **Cómo entenderlo:** Como nombres de carnes. **Mundo real:** Estudiante usa carnes: Dice 'Quiero pollo', Ordena carnes, Vocabulario de carnes usado. Las carnes son importantes. **Mejor práctica:** Aprende nombres de carnes, Usa en oraciones, Practica carnes, Practica vocabulario de carnes."
        },
        {
          "title": "Bebidas 🥤",
          "content": "Las bebidas complementan las comidas. **Bebidas:** Agua (water), Café (coffee), Leche (milk), Jugo (juice), Refresco (soda). **Cómo entenderlo:** Como nombres de bebidas. **Mundo real:** Estudiante usa bebidas: Dice 'Quiero agua', Ordena bebidas, Vocabulario de bebidas usado. Las bebidas son importantes. **Mejor práctica:** Aprende nombres de bebidas, Usa en oraciones, Practica bebidas, Practica vocabulario de bebidas."
        },
        {
          "title": "Frases de Restaurante 🍽️",
          "content": "Las frases de restaurante son esenciales. **Frases:** La cuenta, por favor (The check, please), Quisiera... (I would like...), ¿Qué recomienda? (What do you recommend?), Está delicioso (It's delicious). **Cómo entenderlo:** Como frases útiles en restaurantes. **Mundo real:** Estudiante usa frases: Ordena comida, Pide la cuenta, Usa frases correctamente, Frases de restaurante dominadas. Las frases son útiles. **Mejor práctica:** Aprende frases, Usa en restaurantes, Practica frases, Practica frases de restaurante."
        }
      ],
      "examples": [
        {
          "scenario": "Ordenar Comida",
          "explanation": "Estudiante ordena: Dice 'Quisiera pollo con arroz', Ordena correctamente, Comida ordenada."
        },
        {
          "scenario": "Pedir Bebida",
          "explanation": "Estudiante pide bebida: Dice 'Quiero agua, por favor', Pide correctamente, Bebida pedida."
        },
        {
          "scenario": "Preguntar Recomendaciones",
          "explanation": "Estudiante pregunta: Dice '¿Qué recomienda?', Pregunta correctamente, Recomendación recibida."
        },
        {
          "scenario": "Pedir la Cuenta",
          "explanation": "Estudiante pide cuenta: Dice 'La cuenta, por favor', Pide correctamente, Cuenta recibida."
        }
      ],
      "exercises": [
        {
          "title": "Practica Vocabulario de Comida",
          "instructions": "Paso 1: Aprende vocabulario de frutas. Paso 2: Aprende vocabulario de verduras. Paso 3: Aprende vocabulario de carnes. Paso 4: Aprende vocabulario de bebidas. Paso 5: Practica pronunciar vocabulario. Paso 6: Usa vocabulario en oraciones. Paso 7: Practica vocabulario de comida.",
          "example_answer": "Vocabulario de comida practicado: Frutas aprendidas, Verduras aprendidas, Carnes aprendidas, Bebidas aprendidas, Pronunciado, Oraciones creadas, Vocabulario de comida dominado."
        },
        {
          "title": "Practica Frases de Restaurante",
          "instructions": "Paso 1: Aprende frases de restaurante. Paso 2: Practica ordenar comida. Paso 3: Practica pedir bebidas. Paso 4: Practica preguntar recomendaciones. Paso 5: Practica pedir la cuenta. Paso 6: Crea diálogos de restaurante. Paso 7: Practica frases de restaurante.",
          "example_answer": "Frases de restaurante practicadas: Frases aprendidas, Ordenar practicado, Pedir bebidas practicado, Preguntar recomendaciones practicado, Pedir cuenta practicado, Diálogos creados, Frases de restaurante dominadas."
        },
        {
          "title": "Practica Conversaciones de Comida",
          "instructions": "Paso 1: Repasa vocabulario de comida. Paso 2: Repasa frases de restaurante. Paso 3: Crea conversaciones completas. Paso 4: Practica ordenar comida completa. Paso 5: Practica describir comida. Paso 6: Practica expresar preferencias. Paso 7: Practica conversaciones de comida.",
          "example_answer": "Conversaciones de comida practicadas: Vocabulario repasado, Frases repasadas, Conversaciones creadas, Ordenar practicado, Describir practicado, Preferencias expresadas, Conversaciones de comida dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Vocabulario de Comida en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de vocabulario de comida y restaurantes."
        },
        {
          "title": "Comunicación en Restaurantes",
          "source": "OpenStax",
          "reason": "Cubre vocabulario de comida, bebidas y frases de restaurante."
        }
      ],
      "videos": [
        {
          "title": "Vocabulario de Comida Tutorial – Traversy Media",
          "reason": "Guía completa de vocabulario de comida en español."
        },
        {
          "title": "Restaurantes en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre vocabulario de comida y restaurantes."
        }
      ],
      "summary": "El vocabulario de comida incluye frutas (manzana, plátano, naranja), verduras (tomate, lechuga, zanahoria), carnes (pollo, pescado, carne) y bebidas (agua, café, leche). Las frases de restaurante como 'La cuenta, por favor', 'Quisiera...' y '¿Qué recomienda?' son esenciales para ordenar comida. Saber vocabulario de comida te permite ordenar en restaurantes, comprar en mercados y tener conversaciones sobre comida. Dominar vocabulario de comida y restaurantes es fundamental para situaciones cotidianas en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Preguntas y Conversaciones Básicas",
      "description": "Aprende a hacer preguntas y mantener conversaciones básicas en español. Saber hacer preguntas te permite obtener información y participar en conversaciones. Las preguntas básicas son fundamentales para comunicarte efectivamente. Piensa en las preguntas como herramientas para iniciar y mantener conversaciones.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Preguntas: Una Guía Completa",
          "content": "Paso 1: Aprende palabras interrogativas (qué, quién, dónde, cuándo, cómo, por qué). Paso 2: Aprende preguntas con sí/no. Paso 3: Aprende preguntas informativas. Paso 4: Aprende respuestas básicas. Paso 5: Practica hacer preguntas. Paso 6: Practica responder preguntas. Paso 7: Practica conversaciones básicas. Esta guía te ayuda a dominar preguntas y conversaciones."
        },
        {
          "type": "Guía Visual",
          "title": "Preguntas en Español",
          "content": "Dibuja preguntas: ¿Qué? → ¿Quién? → ¿Dónde? → ¿Cuándo? → ¿Cómo? → ¿Por qué?. Muestra: Palabras interrogativas, Preguntas sí/no, Respuestas. La guía visual ayuda a entender preguntas."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Preguntas",
          "content": "Actividad: Practica preguntas en español. Practica: Palabras interrogativas, Preguntas sí/no, Respuestas, Conversaciones. Practica: Fluidez, Comunicación. Esta actividad mejora tus habilidades de pregunta."
        }
      ],
      "key_points": [
        {
          "title": "Palabras Interrogativas ❓",
          "content": "Las palabras interrogativas inician preguntas. **Palabras:** ¿Qué? (What?), ¿Quién? (Who?), ¿Dónde? (Where?), ¿Cuándo? (When?), ¿Cómo? (How?), ¿Por qué? (Why?). **Cómo entenderlo:** Como palabras que inician preguntas. **Mundo real:** Estudiante usa interrogativas: Hace preguntas, Obtiene información, Preguntas usadas correctamente. Las interrogativas son esenciales. **Mejor práctica:** Aprende interrogativas, Usa en preguntas, Practica preguntas, Practica palabras interrogativas."
        },
        {
          "title": "Preguntas Sí/No ✅",
          "content": "Las preguntas sí/no son simples. **Formato:** ¿Verbo + sujeto? (¿Eres estudiante?), ¿Estás bien? (Are you okay?). **Cómo entenderlo:** Como preguntas que requieren sí o no. **Mundo real:** Estudiante hace preguntas sí/no: Pregunta '¿Eres estudiante?', Recibe respuesta, Preguntas sí/no usadas. Las preguntas sí/no son comunes. **Mejor práctica:** Aprende formato, Hace preguntas sí/no, Practica preguntas, Practica preguntas sí/no."
        },
        {
          "title": "Respuestas Básicas 💬",
          "content": "Saber responder es tan importante como preguntar. **Respuestas:** Sí (Yes), No (No), Tal vez (Maybe), No sé (I don't know). **Cómo entenderlo:** Como respuestas simples. **Mundo real:** Estudiante responde: Responde 'Sí', Responde 'No', Responde apropiadamente, Respuestas usadas. Las respuestas son importantes. **Mejor práctica:** Aprende respuestas, Responde apropiadamente, Practica respuestas, Practica respuestas básicas."
        },
        {
          "title": "Conversaciones Básicas 🗣️",
          "content": "Las conversaciones básicas combinan preguntas y respuestas. **Elementos:** Saludos, Preguntas, Respuestas, Despedidas. **Cómo entenderlo:** Como mantener una conversación. **Mundo real:** Estudiante conversa: Saluda, Hace preguntas, Responde, Se despide, Conversación mantenida. Las conversaciones son esenciales. **Mejor práctica:** Aprende elementos, Practica conversaciones, Mantiene conversaciones, Practica conversaciones básicas."
        },
        {
          "title": "Expresiones Útiles 💡",
          "content": "Las expresiones útiles mejoran las conversaciones. **Expresiones:** Por favor (Please), Gracias (Thank you), De nada (You're welcome), Lo siento (I'm sorry). **Cómo entenderlo:** Como frases de cortesía. **Mundo real:** Estudiante usa expresiones: Usa 'Por favor', Usa 'Gracias', Muestra cortesía, Expresiones usadas. Las expresiones son útiles. **Mejor práctica:** Aprende expresiones, Usa apropiadamente, Muestra cortesía, Practica expresiones útiles."
        }
      ],
      "examples": [
        {
          "scenario": "Hacer Preguntas",
          "explanation": "Estudiante hace preguntas: Pregunta '¿Qué es esto?', Pregunta '¿Dónde está?', Preguntas hechas correctamente."
        },
        {
          "scenario": "Responder Preguntas",
          "explanation": "Estudiante responde: Responde 'Sí, soy estudiante', Responde apropiadamente, Respuestas dadas."
        },
        {
          "scenario": "Conversación Básica",
          "explanation": "Estudiante conversa: Saluda, Hace preguntas, Responde, Mantiene conversación."
        },
        {
          "scenario": "Usar Expresiones",
          "explanation": "Estudiante usa expresiones: Dice 'Por favor', Dice 'Gracias', Muestra cortesía."
        }
      ],
      "exercises": [
        {
          "title": "Practica Palabras Interrogativas",
          "instructions": "Paso 1: Aprende palabras interrogativas. Paso 2: Practica pronunciar interrogativas. Paso 3: Crea preguntas con cada interrogativa. Paso 4: Practica hacer preguntas. Paso 5: Usa interrogativas en oraciones. Paso 6: Practica con diferentes contextos. Paso 7: Practica palabras interrogativas.",
          "example_answer": "Palabras interrogativas practicadas: Interrogativas aprendidas, Pronunciadas, Preguntas creadas, Preguntas hechas, Oraciones con interrogativas, Contextos practicados, Palabras interrogativas dominadas."
        },
        {
          "title": "Practica Preguntas y Respuestas",
          "instructions": "Paso 1: Aprende formato de preguntas sí/no. Paso 2: Aprende respuestas básicas. Paso 3: Practica hacer preguntas sí/no. Paso 4: Practica responder preguntas. Paso 5: Crea diálogos de preguntas y respuestas. Paso 6: Practica con diferentes temas. Paso 7: Practica preguntas y respuestas.",
          "example_answer": "Preguntas y respuestas practicadas: Formato aprendido, Respuestas aprendidas, Preguntas hechas, Respuestas dadas, Diálogos creados, Temas practicados, Preguntas y respuestas dominadas."
        },
        {
          "title": "Practica Conversaciones Completas",
          "instructions": "Paso 1: Repasa saludos y despedidas. Paso 2: Repasa preguntas. Paso 3: Repasa respuestas. Paso 4: Crea conversaciones completas. Paso 5: Practica mantener conversaciones. Paso 6: Practica con diferentes situaciones. Paso 7: Practica conversaciones completas.",
          "example_answer": "Conversaciones completas practicadas: Saludos repasados, Preguntas repasadas, Respuestas repasadas, Conversaciones creadas, Conversaciones mantenidas, Situaciones practicadas, Conversaciones completas dominadas."
        }
      ],
      "textbooks": [
        {
          "title": "Preguntas y Conversaciones en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de preguntas y conversaciones básicas."
        },
        {
          "title": "Comunicación Básica en Español",
          "source": "OpenStax",
          "reason": "Cubre preguntas, respuestas y conversaciones básicas."
        }
      ],
      "videos": [
        {
          "title": "Preguntas en Español Tutorial – Traversy Media",
          "reason": "Guía completa de preguntas y conversaciones en español."
        },
        {
          "title": "Conversaciones Básicas en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre preguntas y conversaciones."
        }
      ],
      "summary": "Las palabras interrogativas (¿Qué?, ¿Quién?, ¿Dónde?, ¿Cuándo?, ¿Cómo?, ¿Por qué?) inician preguntas informativas. Las preguntas sí/no requieren respuestas simples (Sí/No). Saber responder apropiadamente es tan importante como hacer preguntas. Las conversaciones básicas combinan saludos, preguntas, respuestas y despedidas. Las expresiones útiles (Por favor, Gracias, De nada) mejoran las conversaciones y muestran cortesía. Dominar preguntas y conversaciones básicas es fundamental para comunicarte efectivamente en español."
    },
    {
      "course": "Spanish",
      "level": "Basic",
      "topic": "Vocabulario de Familia y Relaciones",
      "description": "Aprende vocabulario relacionado con familia y relaciones personales en español. Saber hablar sobre tu familia y relaciones te permite tener conversaciones personales y conectarte con otros. Piensa en el vocabulario de familia como herramientas para hablar sobre las personas importantes en tu vida.",
      "instructional_materials": [
        {
          "type": "Guía Paso a Paso",
          "title": "Aprendiendo Vocabulario de Familia: Una Guía Completa",
          "content": "Paso 1: Aprende miembros de familia inmediata (padre, madre, hermano, hermana). Paso 2: Aprende miembros de familia extendida (abuelo, abuela, tío, tía). Paso 3: Aprende relaciones (esposo, esposa, hijo, hija). Paso 4: Aprende adjetivos posesivos con familia. Paso 5: Practica describir familia. Paso 6: Usa vocabulario en oraciones. Paso 7: Practica vocabulario de familia. Esta guía te ayuda a dominar vocabulario de familia."
        },
        {
          "type": "Guía Visual",
          "title": "Familia en Español",
          "content": "Dibuja familia: Familia inmediata → Familia extendida → Relaciones. Muestra: Vocabulario, Posesivos, Descripciones. La guía visual ayuda a entender vocabulario de familia."
        },
        {
          "type": "Ejercicio Interactivo",
          "title": "Practica Vocabulario de Familia",
          "content": "Actividad: Practica vocabulario de familia en español. Practica: Miembros de familia, Relaciones, Posesivos, Descripciones. Practica: Oraciones, Conversaciones. Esta actividad mejora tu vocabulario de familia."
        }
      ],
      "key_points": [
        {
          "title": "Familia Inmediata 👨‍👩‍👧‍👦",
          "content": "La familia inmediata es la más cercana. **Miembros:** Padre (father), Madre (mother), Hermano (brother), Hermana (sister), Hijo (son), Hija (daughter). **Cómo entenderlo:** Como tu familia más cercana. **Mundo real:** Estudiante habla de familia: Dice 'Mi padre', Dice 'Mi hermana', Habla de familia, Vocabulario de familia usado. La familia inmediata es importante. **Mejor práctica:** Aprende miembros de familia, Usa en oraciones, Practica familia, Practica vocabulario de familia inmediata."
        },
        {
          "title": "Familia Extendida 👴👵",
          "content": "La familia extendida incluye parientes. **Miembros:** Abuelo (grandfather), Abuela (grandmother), Tío (uncle), Tía (aunt), Primo (cousin), Prima (cousin female). **Cómo entenderlo:** Como familia más amplia. **Mundo real:** Estudiante habla de familia extendida: Dice 'Mi abuelo', Dice 'Mi tía', Habla de familia extendida, Vocabulario usado. La familia extendida es importante. **Mejor práctica:** Aprende miembros extendidos, Usa en oraciones, Practica familia extendida, Practica vocabulario de familia extendida."
        },
        {
          "title": "Relaciones 💑",
          "content": "Las relaciones describen conexiones. **Relaciones:** Esposo (husband), Esposa (wife), Novio (boyfriend), Novia (girlfriend), Amigo (friend), Amiga (friend female). **Cómo entenderlo:** Como personas con quienes tienes relaciones. **Mundo real:** Estudiante habla de relaciones: Dice 'Mi esposo', Dice 'Mi amigo', Habla de relaciones, Vocabulario usado. Las relaciones son importantes. **Mejor práctica:** Aprende relaciones, Usa en oraciones, Practica relaciones, Practica vocabulario de relaciones."
        },
        {
          "title": "Posesivos con Familia 💼",
          "content": "Los posesivos se usan con familia. **Posesivos:** Mi (my), Tu (your), Su (his/her), Nuestro (our). **Cómo entenderlo:** Como indicar relación familiar. **Mundo real:** Estudiante usa posesivos: Dice 'Mi padre', Dice 'Tu hermana', Usa posesivos correctamente, Posesivos usados. Los posesivos son esenciales. **Mejor práctica:** Aprende posesivos, Usa con familia, Practica posesivos, Practica posesivos con familia."
        },
        {
          "title": "Describir Familia 📝",
          "content": "Describir familia combina vocabulario. **Elementos:** Miembros, Relaciones, Adjetivos, Oraciones. **Cómo entenderlo:** Como hablar sobre tu familia. **Mundo real:** Estudiante describe: Describe miembros, Usa adjetivos, Crea oraciones, Familia descrita. Describir familia es útil. **Mejor práctica:** Aprende elementos, Practica describir, Crea descripciones, Practica describir familia."
        }
      ],
      "examples": [
        {
          "scenario": "Hablar de Familia Inmediata",
          "explanation": "Estudiante habla: Dice 'Mi padre es médico', Dice 'Mi hermana estudia', Habla de familia correctamente."
        },
        {
          "scenario": "Hablar de Familia Extendida",
          "explanation": "Estudiante habla: Dice 'Mi abuelo vive en España', Dice 'Mi tía es profesora', Habla de familia extendida."
        },
        {
          "scenario": "Usar Posesivos",
          "explanation": "Estudiante usa posesivos: Dice 'Mi esposo', Dice 'Tu hermana', Posesivos usados correctamente."
        },
        {
          "scenario": "Describir Familia",
          "explanation": "Estudiante describe: Describe 'Tengo dos hermanos', Usa adjetivos, Familia descrita."
        }
      ],
      "exercises": [
        {
          "title": "Practica Vocabulario de Familia",
          "instructions": "Paso 1: Aprende miembros de familia inmediata. Paso 2: Aprende miembros de familia extendida. Paso 3: Aprende relaciones. Paso 4: Practica pronunciar vocabulario. Paso 5: Usa vocabulario en oraciones. Paso 6: Crea descripciones de familia. Paso 7: Practica vocabulario de familia.",
          "example_answer": "Vocabulario de familia practicado: Familia inmediata aprendida, Familia extendida aprendida, Relaciones aprendidas, Pronunciado, Oraciones creadas, Descripciones creadas, Vocabulario de familia dominado."
        },
        {
          "title": "Practica Posesivos con Familia",
          "instructions": "Paso 1: Aprende posesivos. Paso 2: Practica usar posesivos con familia. Paso 3: Usa posesivos en oraciones. Paso 4: Practica con diferentes miembros. Paso 5: Crea oraciones con posesivos. Paso 6: Practica posesivos. Paso 7: Practica posesivos con familia.",
          "example_answer": "Posesivos con familia practicados: Posesivos aprendidos, Usados con familia, Oraciones con posesivos, Diferentes miembros practicados, Oraciones creadas, Posesivos dominados."
        },
        {
          "title": "Practica Describir Familia",
          "instructions": "Paso 1: Repasa vocabulario de familia. Paso 2: Repasa posesivos. Paso 3: Aprende adjetivos descriptivos. Paso 4: Crea descripciones completas. Paso 5: Practica describir tu familia. Paso 6: Practica preguntar sobre familia. Paso 7: Practica describir familia.",
          "example_answer": "Describir familia practicado: Vocabulario repasado, Posesivos repasados, Adjetivos aprendidos, Descripciones creadas, Tu familia descrita, Preguntas practicadas, Describir familia dominado."
        }
      ],
      "textbooks": [
        {
          "title": "Vocabulario de Familia en Español",
          "source": "Open Textbook Library",
          "reason": "Proporciona una guía completa de vocabulario de familia y relaciones."
        },
        {
          "title": "Relaciones Personales en Español",
          "source": "OpenStax",
          "reason": "Cubre vocabulario de familia, relaciones y posesivos."
        }
      ],
      "videos": [
        {
          "title": "Vocabulario de Familia Tutorial – Traversy Media",
          "reason": "Guía completa de vocabulario de familia en español."
        },
        {
          "title": "Familia y Relaciones en Español – freeCodeCamp",
          "reason": "Tutorial completo sobre vocabulario de familia y relaciones."
        }
      ],
      "summary": "El vocabulario de familia incluye miembros inmediatos (padre, madre, hermano, hermana) y extendidos (abuelo, abuela, tío, tía). Las relaciones (esposo, esposa, novio, novia, amigo) describen conexiones personales. Los adjetivos posesivos (mi, tu, su, nuestro) se usan frecuentemente con vocabulario de familia. Saber describir tu familia te permite tener conversaciones personales y conectarte con otros. Dominar vocabulario de familia y relaciones es fundamental para hablar sobre las personas importantes en tu vida en español."
    }
  ]
}

